[
  {
    "id": 2,
    "date": "Monday May 1, 2023",
    "slug": "kids-fuck",
    "title": "Kids. F*#$!",
    "body": "<p>I’m a Dad. It’s still staggeringly accepted that Dads have little to do with the parenting process. If not so extreme, it’s at minimum accepted that Moms are the ones that still do all the heavy lifting. Dads that are “involved” in 2023. They show up to a couple things, do some drops off, and everyone thinks they’re progressive. I watched a talk show the other day that got into bullying. It was all “Mama bear” this and “No offence to the Dads in the audience, but the Moms take care of this stuff” that. I was like fuck you. I still want to crush the little shit in my oldest’s class that keeps giving unsolicited, space-violating hugs. And of course in practice these social constructs aren’t true. Dads now are in large part equal parents with their partners. They do fully half (or more) of the work—from household management, to school drop offs, parenting, research, shopping, etc.—that would traditionally be assumed by the Mother. I want to be the best, most available, most supportive, most loving, most nurturing, most protective, most educational parent I can possibly be. And I don’t attribute this to something only Moms or Dads do. It’s just parenting. Loving your kids. As such, my wife and I have shared equally in the extreme difficulty of these first years of our kids’ lives. As I write this, in the quiet of a house with kids at daycare, finally about 75% healthy after an episode of Strep throat, followed promptly by an extreme bout of Norovirus, I feel confident in saying I am better for it. Check back with me after pick up time. I might have a different answer.</p><p>I wrote most of the content in this book directly after brutal, terrible, nervous-breakdown-inducing kid-incidents: terrible screaming nights, terrible screaming car rides, terrible screaming afternoons for no reason (or maybe it was just hunger), terrible screaming mornings after starting out just fine, terrible screaming leaving-the-house incidents, terrible mood swings. It makes for some brutal, cynical, depressing (and hopefully funny) writing. And in spite of this, it should be said that the sweet, loving, quiet moments you see in magazines and on social media <em>do</em> happen: and they’re pure gold. They make it all worthwhile (almost). No they really do (mostly). They do.</p><p>It’s just that the mania and unrelentingness of parenting (at least in my life, with my kids) is so much, so constant, so intense, so crushing, so exhausting, so underrepresented, so glazed-over and “positivized” by parent (Mom) blogs and Instagram feeds and Christmas card photos and wannabe influencers and friends afraid that if they tell the truth about the insanity of it, everyone will think they’re bad people or shitty parents or that it’s actually hard - that the reality of it needs to be laid out in all its gory detail.</p><p>It also needs to be said that every time I dive back in here to add a section or elaborate on another nightmare scenario, or rant about another episode of sickness (like right now), there is more to add. There are updates that can be made. There are things (a lot) that can change. My youngest kid is older and doing more. My oldest kid is older and doing more. Things are better and things are worse. There are more hilarious scenes. There are more horrifying and completely dehumanizing scenes. I’ll have to at some point just accept that there is enough in here to give you a basic idea, and the rest—I’ll save for Vol. 2.</p>"
  },
  {
    "id": 1,
    "date": "Thursday April 6, 2023",
    "slug": "my-first-post",
    "categories": {
      "cat1": "Vuejs",
      "cat2": "Javascript",
      "cat3": "Frontend Development",
      "cat4": "Dynamic Routing"
    },
    "title": "How to Set up a Vue app with Vite, SASS, Vue Router, Bootstrap, and other goodies.",
    "body": "<p>I’ve been getting up to speed on Vue 3 and Vite. There are a lot of differences from Vue 2 and the Vue CLI — even just spooling up a new project . This article runs through a super simple setup to get you going with all the core stuff.</p><p>Photo by&nbsp;<a href=\"https://unsplash.com/@seemoris?utm_source=medium&amp;utm_medium=referral\" rel=\"noopener noreferrer nofollow\">Caleb George</a>&nbsp;on&nbsp;<a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\" rel=\"noopener noreferrer nofollow\">Unsplash</a></p><p><em>*This article assumes you have node and npm installed on your machine. If not download/install the&nbsp;<a href=\"https://nodejs.org/en/download/\" rel=\"noopener noreferrer nofollow\">LTS version of node</a>, and the latest version of&nbsp;<a href=\"https://docs.npmjs.com/downloading-and-installing-node-js-and-npm\" rel=\"noopener noreferrer nofollow\">npm</a>.</em></p><h1><strong>Here we go</strong></h1><p>Start by installing Vite — run this in your terminal:</p><p><code>npm init vite@latest</code></p><p>This will prompt you with a bunch of choices for your setup:</p><p><code>✔ Project name: … your-super-duper-vite-app-name</code></p><p>Framework of choice:</p><pre><code>? Select a framework: › — Use arrow-keys. Return to submit. \n  Vanilla\n❯ Vue\n  React\n  Preact\n  Lit\n  Svelte</code></pre><p>Select a variant. For the best customizing experience, select&nbsp;<code>Customize with create-vue</code>:</p><pre><code>? Select a variant: › — Use arrow-keys. Return to submit.\n JavaScript\n TypeScript\n❯ Customize with create-vue\n Nuxt</code></pre><p>The selections below are my preferences, but you can choose what works for you:</p><pre><code>✔ Select a variant: › Customize with create-vue\nVue.js - The Progressive JavaScript Framework✔ Add TypeScript? … No / Yes\n✔ Add JSX Support? … No / Yes\n✔ Add Vue Router for Single Page Application development? … No / Yes\n✔ Add Pinia for state management? … No / Yes\n✔ Add Vitest for Unit Testing? … No / Yes\n✔ Add Cypress for End-to-End testing? … No / Yes\n✔ Add ESLint for code quality? … No / Yes\n✔ Add Prettier for code formatting? … No / Yes</code></pre><p><strong><a href=\"https://pinia.vuejs.org/\" rel=\"noopener noreferrer nofollow\">Pinia</a></strong>&nbsp;has replaced&nbsp;<a href=\"https://vuex.vuejs.org/\" rel=\"noopener noreferrer nofollow\">Vuex</a>&nbsp;as the official state management library for Vue. It works with Vue 2 and 3, and both the options and composition APIs.</p><p><code>cd</code>&nbsp;into the project folder, install npm, and run your dev server:</p><pre><code>Done. Now run:cd vite-app\nnpm install\nnpm run dev</code></pre><h1><strong>SASS</strong></h1><p>For SASS, LESS, or stylus support, you have to install node-sass manually (I use SASS — see below for Bootstrap specific notes on installing SASS):</p><pre><code># .scss and .sass \nnpm add -D sass# .less \nnpm add -D less# .styl and .stylus \nnpm add -D stylus</code></pre><p><em>Check&nbsp;</em><strong><em><a href=\"https://vitejs.dev/guide/features.html#css-pre-processors\" rel=\"noopener noreferrer nofollow\">here</a></em></strong><em>&nbsp;for Vite docs on CSS preprocessors.</em></p><h1><strong>Bootstrap 5</strong></h1><p>With the latest version 5 of Bootstrap, there is no jQuery so it can be used directly in a Vue project without the need for a wrapper or other library like BootstrapVue (which is admittedly awesome). I like this for the ability to use the latest Bootstrap classes and components, and for keeping your stack current (as of this writing BootstrapVue uses Bootstrap version 4*).</p><p>To install (from the Bootstrap docs under&nbsp;<a href=\"https://getbootstrap.com/docs/5.2/getting-started/vite/\" rel=\"noopener noreferrer nofollow\">Vite</a>):</p><pre><code>npm i --save bootstrap @popperjs/core</code></pre><p>Then&nbsp;<strong>Install additional SASS dependency.</strong>&nbsp;We need another dependency (Sass) to properly import and bundle Bootstrap’s CSS:</p><pre><code>npm i --save-dev sass</code></pre><p><strong>Now create an SCSS folder and add a&nbsp;</strong><code>styles.scss</code><strong>&nbsp;file inside it to import Bootstrap’s CSS.</strong>&nbsp;The complete path will be:</p><pre><code>./assets/scss/styles.scss</code></pre><p>Then in&nbsp;<code>styles.scss</code>, import all of Bootstrap’s CSS/SASS files with:</p><pre><code>@import \"~bootstrap/scss/bootstrap\";</code></pre><p>And import this into your project by going into your&nbsp;<code>main.js</code>&nbsp;file and adding:</p><pre><code>import \"bootstrap/dist/css/bootstrap.min.css\"\nimport \"./assets/scss/styles.scss\"</code></pre><p><strong><em>*An important note that I missed the first time around with this setup:&nbsp;</em></strong><em>you have to add a few lines in&nbsp;</em><code>vite.config.js</code><em>&nbsp;to set up Bootstrap’s SASS import for Vite to find your Bootstrap’s SASS files in&nbsp;</em><code>node_modules</code><em>:</em></p><pre><code>// Add this to your vite.config.js:\n// const path = require('path')\n// '~bootstrap': path.resolve(__dirname, 'node_modules/bootstrap')\n\nimport { fileURLToPath, URL } from 'node:url'\n\nimport { defineConfig } from 'vite'\nimport vue from '@vitejs/plugin-vue'\n\nconst path = require('path')\n\n// <a href=\"https://vitejs.dev/config/\" rel=\"noopener noreferrer nofollow\">https://vitejs.dev/config/</a>\nexport default defineConfig({\n  plugins: [vue()],\n  resolve: {\n    alias: {\n      '@': fileURLToPath(new URL('./src', import.meta.url)),\n      '~bootstrap': path.resolve(__dirname, 'node_modules/bootstrap')\n    }\n  }\n})</code></pre><p>Finally, add the Bootstrap JS components to your Vue project entrypoint (ie:&nbsp;<code>src/main.js</code>):</p><pre><code>import \"bootstrap\"\n\n// So your total Bootstrap import statement will be:\nimport \"bootstrap/dist/css/bootstrap.min.css\"\nimport \"./assets/scss/styles.scss\"\nimport \"bootstrap\"</code></pre><p><em>*Great stackoverflow post&nbsp;</em><strong><em><a href=\"https://stackoverflow.com/questions/65547199/using-bootstrap-5-with-vue-3\" rel=\"noopener noreferrer nofollow\">here</a></em></strong><em>&nbsp;on Bootstrap 5 installation and usage tips.<br>**Check the Bootstrap Vite docs&nbsp;</em><strong><em><a href=\"https://getbootstrap.com/docs/5.2/getting-started/vite/\" rel=\"noopener noreferrer nofollow\">here</a></em></strong><em>.</em></p><h1><strong>Conclusion</strong></h1><p>And that’s it! The Vite experience in my opinion is pretty awesome: it’s fast, easy, and the lightning dev server that everyone’s talking about is worth it alone. Hopefully this short guide gets you set up quickly so you can start building.</p>"
  }
]