{
  "blog": [
    {
      "id": "4",
      "imageUrl": "https://source.unsplash.com/1200x600?black,minimal",
      "title": "Kids vs. Krav Maga",
      "body": "<p>I studied the super aggressive, highly brutal, military derived, and totally awesome Israeli martial art of Krav Maga for a little over 3 years. I still consider myself a practitioner and try to train when I can and hold onto the mindset. While there are myriad clubs and different streams and a thousand videos with guys in camo, you don't see a lot of the <em>genuine</em> art online unless you sniff it out. The legit organizations are more secretive and don't post bullshit about how many asses they kicked using this knee to that groin. It’s an art that combines the most effective self defence techniques from a variety of arts (striking, grappling, weapons) with a goal of simplicity and ease of learning. Classes aren’t full of movie stances, animal postures, chi extension, or crane kicks (I loved Karate Kid). They aim to recreate live situations: i.e. defending yourself from someone actually attacking you. Which means flashing lights, surprise attacks, blindfolds, blaring music, yelling, screaming, choking, gouging, and actual fighting. They build into you a mindset of aggressiveness, instinctive reaction, and self preservation. They are destructive and <em>amazing</em>. And then there are the tests. Krav belt tests run into the 5+ hour mark -- longer for the higher levels. Fitness, techniques, sparring, self defence -- it's the most gruelling and physically taxing thing I'd ever done.</p><p>Until having kids.</p><p>One of my teachers whose fame will live on eternal as the drill sergeant instructor would talk about building your mental and physical toughness to a point where you can't be broken. “You can’t break me” he’d routinely say. And I still believe it. If you water boarded him he’d find a way to make you cry before somehow finding a way to kick you in the balls even as he died, while laughing, calling you a little bitch with his last breath. Krav is about not giving up. Even if you're tired, weak, out of shape, hungover, beat up, have shitty technique, or just suck—you do your best. You keep going. You don't stop. You fight. Tooth and nail.&nbsp; Until you're safe, your attacker is disabled, or the class is over. Before kids, I would have said I’m relatively tough. I can hold my own. I was a respected member of my club. And for a while felt like I was on track to become an instructor. When people said how brutal Krav is, I’d always say “Ya it is. It fucking rules\".</p><p>But after two belt tests and 3 years of weekly practice, I can with total confidence and authority say that <em>a baby</em> - not Krav Maga - thoroughly and completely broke me. Incessant crying. Incessant whining. Incessant, repeated, cyclical, constant sickness. Incessant sleeplessness. For <em>years</em>. Not days. Not weeks. Not months. But <em>years</em>. Has broken me. It has deeply affected me, deeply drained and crushed me.&nbsp;</p><p>I mean, I’m still, as I write this, actively alive. And I’m still going. I’m still a parent. I still love my kids. And I guess I still haven’t fully given up. So that's something. But I've cried. A lot. I've aged. A lot. I've hit my limit. A lot. Multiple times. I still hit it. Often. Like this morning. And I've given up. A lot. I had never said “shoot me” and “just kill me, please” in my life up to this point. And I’d certainly never said it <em>repeatedly</em>. A younger, pre-kids me would have been horrified that I’ve said it so much. I never said it in Krav. Not once. Not in a single class. Not in a test. I never felt it. Never felt broken the same way. And while Krav is tough, I would do a class, a belt test, or fight someone - any day of the week - and find it easier than being a parent. Krav is EASY next to having kids. In fact I suggest any bourgeoning parent go study Krav Maga, for a year, at minimum, before having kids.</p><p>Then decide.</p><p>Because you see, classes end. Tests end. Fights end. They might not be pretty. You might get beat up. You might get bruised and broken and shamed and hurt. Even go to the hospital (though not likely, I mean they’re not complete animals). But a broken rib, black eye, concussion, or limp is literally NOTHING compared to a constantly difficult child (much less two, or three, or twins). With a broken rib and no kids, you can sleep. With a broken rib and no kids, you can lie on the couch and rest. With a broken rib and no kids, you can order take-out and watch movies. With a broken rib and no kids, you can sleep. Did I say that one already. Well, fucking read it again. A broken rib heals. It takes months but it gets better. It stops. Kids. Do. Not. Fucking. Stop. Fatigue and sleeplessness do not stop. Crying and whining and tantrums and hating the car do not stop. To be fair, things can, yes, change. But it isn’t fast. And it isn’t complete. They just slowly, slowly change. And usually that change comes with a slew of new problems. Not some “finally, we made it” sunny beach with margueritas and palms trees type ending.</p><p>My oldest for example got to the 3 year old mark and was able to sit in a forward-facing car seat.&nbsp; It was as life changing as anything we’ve so far experienced. He was excited. He could look out. He could see. His whole life experience changed. But it didn’t mean he started just loving the car, or not crying, or not getting super exhausted and screaming after daycare all the way home. It just got <em>better. </em>He still screams and cries and stomps and refuses to go in and refuses to come out and kicks and hits his brother next to him. It’s just an <em>ounce</em> better. That’s the kind of incremental change I’m talking about.</p>",
      "date": "Monday May 8, 2023",
      "slug": "kids-vs-krav-mage",
      "tags": [
        {},
        {
          "category": "Krav Maga"
        }
      ]
    },
    {
      "title": "Wine Time",
      "body": "<p>When you have kids you enter this alternate world. It's a bit like war. Only vets actually <em>know</em>. Okay so ya that's a bit extreme. And way too soon. It's not <em>quite</em> the same. I mean at least war <em>ends</em> right (at some point)? The buildings can be rebuilt. Economies come back. Kids are for-fucking-<em>ever</em> man. Okay, so ya, still, not quite the same. I mean it's kind of the same. But less violent. Sometimes.</p><p>Still, in this kid world, you start seeing and resonating with piles of Instagram “wine time” memes, diaper blow out jokes (which you don’t ever hear about the way you really, really should--not the way they really, really happen), snippets about tantrums, potty training, jokes about teenagers, pot, and you'll for the life of you hear more than you ever wanted to, that \"They grow up so fast\". But it's rarely real. Like you don't actually get into <em>why</em> the Mommy needs wine meme is a meme. And for some reason it always has to be funny. I mean everything’s better if it’s funny. Especially the hard shit. Even more so with kid shit. And actual shit. But the <em>funny</em> belies the <em>reality</em>. Like instagram. And aside from the funny, no one gets that deeply into why that little 3 second tiktok is a complete and totally accurate summation of existence. To the point where you just laugh and nod and say, “Yep, that’s it”. Then cry.</p><p>Enter a Mom on loop chugging a <em>gigantic</em> glass of wine. In a gigantic glass. With so much room that “I could really use a gigantic glass of wine right now” fits etched on the side. Yes it’s funny. Yes it’s real. Yes it’s a complete and totally accurate summation of her existence. And my existence. And every other parent’s.</p><p>But she’s not drinking it because it’s funny. Or because she’s trying to be funny. She NEEDS it. She HAS to have it. It returns some sense of sanity. It’s a break. It helps her forget. And in the meme you don’t see she’s covered in shit. And spit up. She stinks. She hasn’t showered in days.&nbsp; She hasn’t changed her clothes in days. Because she has no clothes. They’re either dirty, or don’t fit her anymore, or aren’t in style anymore, or are maternity wear which doesn’t fit but she continues to wear because nothing is clean. She hasn’t left the house in days. Two piles of laundry are sitting at her feet. Just out of the shot. And there’s another that’s even more annoying because it’s clean and has to be put away. Any makeup she’s wearing is accidental. Or maybe also just shit. And she still has a bunch of stuff to do before going to bed after said wine. Where she likely won’t sleep. Where she likely will be woken up, multiple times. At which point she’ll do it all over again, and wait, all day, for that meme again. Which means, in reality, she has a drinking problem.</p><h3><strong>Beer time</strong></h3><p>Now picture that same Mom meme. But with a beer. A gigantic glass of beer. And a Dad. It’s the SAME. Maybe not <em>entirely</em> given the previous rant about modern Moms and Dads and responsibility sharing. But it’s close. And since it’s more normalized (i.e. totally expected and supported by years of movies and books and pop culture and actual examples) that guys will wear the same underwear (and anything) for X days in a row, not shower, not do laundry, not clean, and chug a glass of beer/wine at most any time of day, it comes off in a less tragic and more “Haha, typical dude” kind of way. But it isn’t. It’s just the same kind of medicine.</p><p>With my first child, it was pandemic. The curtain had just fallen. The world went dark. He was about 8 months old. Everyone was scrambling to figure it out. All the in-person service businesses were shuttered and fucked. It took less than a month for the breweries and wineries to offer delivery. Halle-fuckin-lluia. Why was this the first time anyone thought of beer delivery? Within a week I had my first order. It showed up on my doorstep within 24hrs. Two 2-4s and a 6-pack. I took pictures. I got a text notification. It was so exciting. It was a whole new world. I’d actually never been the type to buy 2-4s. It’s too much at once. And expensive. A 6, an 8, a 12. Then come back for more. But this was another level. It was a new time. Why not stock up? I can’t just go back to the brewery. Wait, I CAN’T go anywhere. It was a different life. A new way of thinking. It hadn’t happened before. Everyone was trying to sort it out at once. Stay at home? What? All day? Every day? And do what? Back to the 2-4s. I mean the TWO 2-4s. And a 6 pack. Enter a global drinking problem.&nbsp;</p><p>But if I back up a bit, it was this way, albeit a little more responsible, prior to Covid. Alcohol was already a big part of our lives. Beers after work, beers on weekends, craft brewery taprooms, flights, wine, and of course, drinks in the evenings. The pandemic surely gave us more time to drink, but it’s fair to say it amplified an existing situation. What did change our drinking for the heavier was having a newborn. Enter the wine/beer time. The whole no sleep, difficulty feeding, waking up at all hours thing doesn’t lend well to not drinking. We were high on having our first kid, in our first house, and delirious on adrenaline and zero sleep. Alcohol made almost everything better (mornings being the glaring exception). Once ‘demic arrived, the combo of difficult infant and being homebound because of a frightening global virus brought the drinking to a new level altogether. Enter the 2-4s yet again. 2-3 beers a night became more or less the baseline. It was fun. It was freeing. It was festive. Everyone was doing it. And Christ did we ever need the medicine. Alcohol gave us the escape we needed. A slice of humanity (I refuse to say “normalcy” for all the abuse and overuse that term got over 3-4 years of people complaining about not being able to see other people). A sliver of hope. A glow of possibility.</p><p>But the facts remained the same. We’d wake up, slightly hung, to all the same realities. Screaming kid. No sleep. Difficulty feeding. Stress. Fatigue. Laundry. Mess. Round and round. With our second kid, I dove headlong into teetotalling. I’d had enough of the hangovers. A small backstory snippet is that I always and forever got unfairly hungover. Sometimes from 1 drink, often from 2, always from more than two. It sucked. It was also not cool to be drinking while my pregnant wife sat next to me. The combo of the two gave way to picking up all the non-alcoholic beer options on the market. There are some good ones. And they’re increasing because Moms and Dads that love craft beer can’t drink anymore because of their f*#$ing kids.</p><p>The occasional person and maybe one or two of the parenting books will give you a tiny inkling of the reality behind the diaper. But nowhere, in my experience, do you get a low down, dirty, real-life, play by play assessment from real parents—especially those who don't have nannies or grandparents or babysitters or others that do most of the actual parenting—or those who have kids that are so easy they raise themselves. Or from real parents, parenting real, difficult kids.</p><p>Before our first child, we tried to do what every new parent does. We bought all the books, talked to friends, read articles, did the prenatal course. I could tell you the best positions to relieve labour pain and encourage contractions with my eyes closed. Olive oil on the perineum is a thing. Dried fruit, coconut water, nuts: good for the long labour haul. But fuck if it did anything to actually prepare us for what happens after the kid comes out. Or for that matter if you get an epidural. None of that Doula shit is necessary when you’ve got the glory of high level, spinal tapped pain meds on the go. Which means 60-80% of that prenatal course was unnecessary. Don’t bring scents. Don’t bring dried fruit. Don’t prepare motivational phrases. Don’t make a playlist. Don’t suggest zen breathing when she’s bearing down. Just don’t.</p><p>I had friends say \"lean in\", change as many diapers as you can as the Dad, and our perennial favourite: \"it gets better\". I never used the phrase \"shoot me\" before, much less once every other day.</p><p>Kids are miracles. For real. No joke. My wife and I on both sides have friends who either couldn't have kids, or were too old and not in relationships or for other reasons weren't able. We are thankful every day. But they are equally if not more so, difficult, frustrating, incredibly challenging, bundles of joy. They are hands down the most difficult, frustrating, incredibly challenging thing I’ve done in my adult life. And while I’m no hero or professional <em>anything</em>, I’ve done a few things that were hard that couldn’t hold a candle to having kids.</p><p>This blog is my attempt at conveying some of the realities of our lives with two kids up to the age of almost four and a one and a half. I hope it ends up being the kind of thing that would have helped <em>me</em> before having my first kid. I hope it might be the only “baby blog” you’ll need, despite not really giving you any useful information, just a constant stream of difficult anecdotes and real life incidents that have made me want to cry more than ever before in my life. I hope it’s the type of resource that gives parents-to-be a real, yet funny and hopeful (underneath all the dread and fuuuuuck man Jesus Christ almighty stop fucking screaming please fuck, God help me) outlook on parenting.</p>",
      "id": "3",
      "date": "Friday May 4, 2023",
      "imageUrl": "https://source.unsplash.com/1200x600?grapes,red,abstract",
      "slug": "wine-time"
    },
    {
      "tags": [
        {
          "category": "marketing"
        },
        {
          "category": "parenting"
        }
      ],
      "title": "Sunshine & Moonbeams",
      "body": "<p>It’s the hardest time.</p><p>Almost four years ago my wife and I had our first kid. A boy. He's beautiful and amazing and phenomenal. A year and a half ago we had a second son. He too is a miracle and an incredibly joyful addition to our lives. We are grateful, thankful, and better off for having kids.</p><p>Taken together, they're a fucking massive amount of work. And very often they’re an enormous, incalculable, anxiety-inducing, blood-pressure raising pain in the ass. We also managed to get a very, VERY difficult first child, and a second that has slept more or less like balls for a year and a half, which has made the past collectively 5.5 years (and now, and now, and also right now) a sleepless, stress-ridden, early age-inducing debacle.</p><p>After loss of sleep, stress, depression, anxiety, anger, sadness, and almost every other human emotion (including joy, yes), I wanted to document our experience not only for our (lacking and worsening) memory, but in the hopes it might—in contrast to most baby books on the market— <em>actually</em> be mildly useful to new parents or people thinking about being parents or people who wished they were parents with some dream of what it’s like but really have no fucking clue what it actually entails.</p><p>I'll reiterate that the madness that ensues (here and in every post, thought, moment, etc) encapsulates the toddler and infant era--at least in my family. I don't know yet about what comes next. Things might get better tomorrow. They might stay the same. My youngest still has to go through the hellish nightmare of a toddler year we're still in with my oldest. So there's that. And friends with slightly older kids don't seem to complain that much. So they're either lying (which is pretty much the bar), or it does actually improve. On paper I can say I'm confident EVENTUALLY things will improve. In how long? At what age(s)? I don't know. But these past years have been a trial. A test. They're not all goo goo ga ga. Get ready.</p><h3><strong>Good marketing</strong></h3><p>Parenting is not what they tell you in books. There may be no bigger marketing success than the parenting media segment. This most genuinely vulnerable and needy swath of people - new parents (in particular Mothers) - has the largest amount of utter bullshit fed to it from all sides of the media and e-commerce spectrum: books, blogs, products, foods, clothes, furniture, toys, classes, courses, social media groups—it’s all just sunshine and moonbeams and my dearest baby boy this, my darling girl that. The range of books on babies and becoming a parent is <em>staggering</em>. There are the medical ones, there are the philosophical ones, there are the picture ones, there are the what-the-Europeans-do ones, what the hippies do ones, the ones about music and the womb, books from hospitals, books from Moms, books from Dads, books from psychiatrists, from sleep consultants, from non-parents, etc., etc., etc. Not to mention books on feeding, on behaviour, on how to make them geniuses. And then there’s the parenting books for <em>parents</em> like financial planning for single moms, rich parent poor parent, and a host of others.</p><p>While I haven’t come close to reading them all, and while I’m also sure <em>some</em> are useful (if you have time to, you know, sink into an entire book while pregnant and/or working in the hopes that it’ll be the ONE book that does something for you, and you actually, you know, remember anything it says in a, you know, actual, practical moment of need), most of the books fall short. In many to most cases, the books are not in fact useful. They can actually be counter productive. You invest precious time into reading them, assuming, expecting, hoping you’re internalizing some useful information. Information you’ll, you know, <em>use</em> when your baby comes out. And if you’re like us, you bought a LOT of books. So many books there’s no way any human would have the time to read them (unless we started in advance of being pregnant). And because there were so many, we couldn’t even really know which one to focus on. Some have tidbits of useable stuff. But where we did find use, with ALL of them, was as a coaster. Or placemat. Or TV remote holder. Or paper weight. Or decoration on shelves. Perhaps THE most useful application of baby books is when kids are sick: if you stack them up together, they’re great for propping up a crib at one end when your kid has a cold or runny nose.</p><p>But when you have a real kid problem, the books don’t do much. Especially if it’s a problem you’ve tried some stuff for. I could not find more than a single worthwhile article, not to mention book (after days of internet searching) for example on what to do if your kid hates the car. And I don’t mean just the standard “my kid hates the car” my kid hates the car. I mean really, really, <em>really, </em>like can’t even <em>go</em> in the car type my kid hates the car.&nbsp; And I don't mean the useless posts (most likely ghost written by millennials in their one-bedroom condos) talking about seat strap tightness and “have you tried car toys and singing songs together?” I mean like when your child wails—screams—<em>non-stop</em> for the duration of <em>every</em> car ride. Every care ride. Seriously. As soon as the car goes into drive. And until it comes back into park (which for us often literally meant pulling out of the driveway, and pulling right back in).</p><p>As a parent now for 4 collective years, I can say honestly that I have never been so tired. I have aged greatly in a short time. I have not slept well since our first child. I have higher blood pressure than I ever did before. I get emotionally broken and overwhelmed easily. I don't see friends (though often of my own doing, but usually based on fatigue and opportunity-cost i.e. sleep vs. putting on pants). I don't really care to make plans aside from getting out of town with my family when possible. I don't care to do much aside from try to recoup mild amounts of energy between child-related events. General inspiration is low. We look forward most to the two or so hours of the evening after our children are in bed. At which point we mostly stare at the TV with mouths agape. And larger life goals and motivations are not really possible to think about given points A through J.</p><p>But this ladies and gentlemen, is what it means to have kids.</p><p>No one really tells you what it's like. Comedians try. Books try. Movies try. But not anyone who actually knows. Or no one who actually knows and is <em>willing to tell you the truth</em>. And when I say no one, I mean like people who <em>actually have kids</em>. I mean like even your friends who have kids. They just <em>don’t tell you</em>. In part because they’re too tired. In part because they can’t remember what happened yesterday much less a month ago. In part because they don’t want to talk about it. In part because it uses up too much precious player-health-energy to get into the details when those details are the only thing they live, day in, day out. In part because talking about the realities would take so long and make them out to be so depressed and depressing that no one would want to stay to hear it. And in part because they don’t want anyone to know they had (or are actively having) a difficult time and want it to sound like everything is awesome. If people who have kids and know what it’s like actually tell you anything, it’s funny fun stuff. Or funny fun hard stuff. Or funny fun shitty stuff. But always funny. And fun. It has to be a bit. A “story”. Something to talk about with strangers. Another 2 minutes to add to your tight five. Oh my kid’s throwing another lying down screaming crying screaming kicking screaming shitting screaming hitting screaming tantrum: haha, how funny. Those <em>kids</em>.</p><h3><strong>The backyard BBQ</strong></h3><p>Case in point. I was at a backyard bbq the other day. All the families from the street came.&nbsp;So like 7 families. But still. All but one couple had two kids. So that’s 6 x 2 + 1. 13 kids. Now you’d think this would be the place where parents talked about their hardships. If there’s a place to let loose, to let your emotional hair down, to talk to other parents about parenting, it’s a goddamn bbq. The behaviour, the sleep, the sickness, the feeding, the fatigue, the cost, the memory loss, the weight loss, the depression. The din should have been heard three blocks over. But it wasn’t. We should have talked about common experience. But we didn’t. People should have confided in one another, shared stories, supported one another. But it wasn’t. Most of us were actually chasing our kids around. So there’s that.</p><p>The closest it came for me was when a Mom I didn’t know asked what time my youngest goes to bed. As he was approaching full fission reaction around my ankles after a full day at daycare in the hot sun with likely his first sunburn of the season and wild with hunger and fatigue, I said, “now”. Which was almost 6pm. I followed up saying, we start the routine around now, which ends up usually being 30mins to an hour. There was the empathetic nodding and eye rolling and hunched shoulders and sighs and “I’ve been there”’s and “Yaaaa”s. But she didn’t respond so much as just mutter something that sounded a lot like: “Ahhh ya, we don’t talk about that”. Like, it’s too painful to talk about. Or <em>let’s not go there</em>.&nbsp;</p><p>Which seemed funny but oddly appropriate. I didn’t need to get into the difficulty of it with her. It wouldn’t help me in that moment to have someone I didn’t know empathizing. And much as she might want to know more, she doesn’t need to hear yet another stress story of putting kids down for bed. Parents do it every motherfucking night. Do I need to hear YOUR particular issues with it? On TOP of mine?&nbsp;Likewise does it really help <em>me</em> to vent my private toil to someone who’s name I still don’t actually know? Will I feel supported? Will her sympathetic, angle-headed nodding give me the peace and rest I need? Nope.</p><p>But there’s the rub. The people with intimate, hard-won knowledge of one of the most difficult activities in the pantheon of human experience—the best test group for data collection, the most ideal gathering of same experienced people in one place—don’t want to talk about it. Like, “It’s a bbq. Let’s just sip our fucking bubly, chase after our kids playing on this totally not-to-code play structure and eat these Costco burgers, ok?”.</p><p>And that’s where it hit me, you know, <em>again</em>, or maybe just more brutally: the super difficult experience I’ve had for the past 4 years is almost guaranteed to be shared in some way, by at least one other parent in whose company I was then standing. Could I confide in them? Fuck no, I just met them for Chrissakes. You can’t just jump straight into your problems. Even if you both have kids. You don’t know each other. Sharing kid stuff is kind of universal with people you don’t know, but only to a degree. Again, like just the funny stuff.&nbsp; Or the funny brutal stuff. Or the funny not sleeping stuff. Like “how funny, <em>those kids</em>”.</p><p>And that’s pretty much the chestnut of it. Why no one talks about their experience parenting…with <em>other parents</em>. Other parents who also have difficulty. Even if their kids are less difficult. It’s still difficult. But no one else who knows it’s difficult, and shares your difficulty, and knows you are having a difficult time, as they are, makes it any less difficult for you, in your difficulty.</p><p>Near the end, I went to talk to the host who was barbecuing. He has two kids. His partner does a lot, which I know from \"neighbourhood visibility”. But still. I thanked him/them profusely. I said man, this is above and beyond. Thank you. He shrugged, “Ah, you know, it’s just a little thing”. I said “No man. It’s NOT a little thing. It’s a big thing. You’re barbecuing burgers, hot dogs, buns, have condiments, multiple salads with shaved nuts, fizzy drinks, melon-balled fruit plates, and questionable homemade cookies. For 10+ people. This is not little. It’s big. I cannot, and do not, want to do this myself”. Of course it’s polite and part of a host’s job to just say \"Hey, you’re welcome” and not get all emotional like I did. But still. Another example of people with multiple kids, doing hard work, not hinting at the underlying challenges.</p>",
      "id": "2",
      "date": "Tuesday May 3, 2023",
      "imageUrl": "https://source.unsplash.com/1200x600?abstract",
      "slug": "sunshine-and-moonbeams"
    },
    {
      "id": "1",
      "body": "<p>At the time of this writing, Russia’s invasion of Ukraine is nearly into a second year. The Covid pandemic claiming almost 680 million lives is more or less over, but the virus is now endemic, still taking thousands of lives a day in first world countries. Refugees worldwide are increasing at a staggering rate. Climate change and extreme weather (and earthquake) events are on the rise. Authoritarian regimes and far-right politics are gaining and/or holding in support. Violence, racism, inequality, inflation, and cost of living everywhere is high. It’s a dodgy and difficult world right now. There are a lot of problems. Raising kids, or maybe more specifically, <em>complaining</em> about raising kids—while a big responsibility in terms of bringing up the next generation—ranks pretty low on that list by comparison.&nbsp;</p><p>But.&nbsp;</p><p>Raising kids is still fucking brutal. It's a miracle our species procreates willingly. It's got to be an evolutionary development that sex completely short circuits the brain. Those few minutes (or seconds) are just so good that a lifetime of consequences can be totally ignored. There has to be a missed opportunity in there for the far right Christians. No need to use God or guilt or sin or any kind of coercion to force your kids to abstain before marriage. JUST TELL THEM HOW INSANELY BRUTAL IT IS HAVING KIDS.</p><p>Beyond that I've come to believe that parents are nearly invisible for the first 4-5 (or 6) years of their kids' lives. Like unseen. Unheard. Just living. Or being sick. Doing everything possible to stay ALIVE. And that's why no one knows about it. The difficulty. The fatigue. The stress. The fatigue. The memory loss. Sure, you might see them once in a while. They might get a dinner date or some time while their kids are at daycare. But even then, you won't see or hear or learn anything valuable about the utter cave they're in. The grind. The relentlessness. The whining. The fatigue. The memory loss. <em>Wait</em>. Parents, especially new parents don't (really) talk about this stuff. For a lot of reasons. The least of which is it's just  more effort to talk. On top of the day, and last night's sleeplessness, I have to also talk to you? Opening your mouth, thinking, contriving a sentence. It's hard.  It's not like it was back in the day making conversation at bars. The small talk generator is out of service. And don't get me started on the impact to my socialization that is and was the miracle of Covid. I used to be (kind of) funny. Charming. Witty. Able to think on my feet. Now, I talk about my latest glasses prescription. The fact that I need bifocals. I don't want them. But I need them. Cough. I need another coffee. I can barely think of responses to simple, direct questions. Often I just grunt or shake my head and something falls out. It's probably got something to do with the fatigue. And memory loss.</p><p>But still, raising kids is still a fucking <em>wondrous</em> miracle. Despite the difficulty. Child rearing (who decided to call it rearing?) is an insane ride that as a new parent, I was totally unprepared for. I don't mean the concept as a whole. It was pretty evident we were having a kid. We bought the stuff. We got the books. We \"understood\" (theoretically) it would be \"hard\". The issue was the details. The day to day. The reality. What it's actually like. It's a bit audacious to say in 2023 that no one's talking about it. But as I'll get into, despite the books, the resources, the videos, the newsletters, and even your friends, people don't really talk about what it's like to have a kid (or two) the way I wish they had. Like when kids are difficult. Really difficult. When you're at your mental and emotional end. When one more cough, one more cry, one more 3:45am morning makes you clench, cuss, then cry. When things don't work the way the internet says they should. When you’re not in control. When you don’t know. When there aren’t any answers. When it’s not glamorous. When you’re not living the dream. When you’re not winning. When it's ugly. When it's hard. When it’s dark. When you're asking yourself why you made this life choice. The books and resources I found were not helpful. They were full of facts and foods and trends and tips and likelihoods, all infused with happiness and hope. They didn’t deal with the reality. They didn’t deal with the actual experience. They didn’t delve outside the box of usual parenting, with usual kids, having usual issues, that for the most part, weren’t difficult. They didn't help the way I hoped they would in the first years of my kids' lives. And so, in spite of the madness on planet Earth in 2023, I hope this crazy rant gives someone out there like me a bit of a reality check, a bit of support, a bit of hope, and a bit of a laugh in the face of the difficulties (and utter joys) of raising kids.</p><h3><strong>Dadding</strong></h3><p>I’m a Dad. I love it. It’s hard. It’s trying. It’s manic. It’s all the emotions—as I’ll outline in eye rolling, repetitive, bloody detail. But even as a super committed Father, it’s still staggeringly accepted, on average, that Dads have little, if not <em>less</em>, to do with the parenting process. Maybe woke is slower to make its way to Dadding. It’s at minimum accepted that Moms are the ones that still do all the heavy lifting. And to be fair, on average, this is very likely still accurate. But in truth the number of stay at home Dad’s (they really need a better acronym—SAHD is a bit too real) and ones who commit to an equal split of parenting responsibilities, is much bigger than even 10 years ago. Even five years ago. And it’s steadily increasing. Oddly I’ve read the pressures on Mothers to fulfill an idealized role hasn’t abated much with the uptick in Dad-volvement. It’s like modern Mothers (or many) still believe that to be successful and deserve the title, they should be doing everything—despite the assistance of Dads: working AND booking appointments AND making lunches AND responding to emails AND cooking dinner AND cleaning up the house AND doing bedtime routines. But the fact remains that while it may not yet be the norm across a general swath of society, Fathers are more interested, more engaged, more committed, and more willing to be as much a parent as their partners. At least 50% of the parents that drop and pick up their kids at our daycare are Dads. Some, like us, drop the kids together. As a test group, our daycare is predominately white, with some Asian, Brown, and fewer Black families, and the age and financial demographic places us directly in the 30s-40s mid to upper economic spectrum. So while that could be part of the reason we see a more equitable parenting approach, it’s not likely an accurate picture of what it’s like everywhere.</p><h3>Daddy Bear</h3><p>I watched an all-female talk show the other day that got into bullying. It was all “Mama bear” this and “No offence to the Dads in the audience, but just back away, the Moms have got this” that. I was like, fuck you. I still want to crush the little shit in my oldest’s daycare class that keeps giving unsolicited, space-violating hugs. And of course in practice these social constructs aren’t true. Dads now are in large part equal parents with their partners. Some have fully flipped the 1950s norm. I know a couple where the Mom makes so much money it’s not worth it for the Dad to work. He stays home with the kids. Bingo bango. From household management, to school drop offs, parenting, research, shopping, etc., Dads now largely participate in 50% of more of the work that would traditionally be assumed by the Mother. For me, I want to be the best, most available, most supportive, most loving, most nurturing, most protective, most educational parent I can possibly be. And I don’t attribute this to something only Moms do. Or Dads for that matter. It’s just parenting. Loving your kids. As such, my wife and I have shared equally in both the extreme joy, and the extreme difficulty of these first years of our kids’ lives. As I write this, in the quiet of a house with kids at daycare, finally about 75% healthy —after an episode of Strep throat, followed promptly by an extreme bout of Norovirus, in addition to a continuing sinus cold that won’t go away—I feel confident in saying I am better for it. Check back with me after pick up time. I might have a different answer.</p><p>I wrote most of the content of this blog (taken from a larger book concept) directly after brutal, terrible, nervous-breakdown-inducing kid-incidents: terrible screaming nights, terrible screaming car rides, terrible screaming afternoons for no reason (or maybe it was just hunger), terrible screaming mornings after starting out just fine, terrible screaming leaving-the-house incidents, terrible mood swings. It makes for some brutal, cynical, depressing (and hopefully funny) writing. And in spite of this, it should be said that the sweet, loving, quiet moments you see in magazines and on social media <em>do</em> happen: and they’re pure gold. They make it all worthwhile (almost). No they really do (mostly). They do.</p><p>It’s just that the mania and unrelentingness of parenting (at least in my life, with my kids) is so much, so constant, so intense, so crushing, so exhausting, so underrepresented, so glazed-over and “positivized” by parent (Mom) blogs and Instagram feeds and Christmas card photos and wannabe influencers and friends afraid that if they tell the truth about the insanity of it, everyone will think they’re bad people or shitty parents or that it’s actually hard - that the reality of it needs to be laid out in all its gory detail.</p><p>It also needs to be said that every time I dive back in here to add a section or elaborate on another nightmare scenario, or rant about another episode of sickness (like right now), there is more to add. There are updates that can be made. There are things (a lot) that can change. My youngest kid is older and doing more. My oldest kid is older and doing more. Things are better and things are worse. There are more hilarious scenes. There are more horrifying and completely dehumanizing scenes. I’ll have to at some point just accept that there is enough in here to give you a basic idea, and the rest—I’ll save for Vol. 2.</p>",
      "title": "Kids. F*#$!",
      "imageUrl": "https://source.unsplash.com/1200x600?green,landscape",
      "slug": "kids-faakkkkk",
      "tags": [
        {
          "category": "dynamic routing"
        },
        {
          "category": "vue-router"
        },
        {
          "category": "vuejs"
        }
      ],
      "date": "Tuesday May 2, 2023"
    },
    {
      "id": "0",
      "body": "<p>Return of the living Dad. It's got two parts to it. If you're not hip to zombie movies (like me) it's a spoof on Return of the Living Dead. I haven't seen it. But what's there to it? Zombies. Humans trying to avoid becoming zombies. Everyone running around trying to eat or not be eaten. Basically it's life with kids. Then there's the 'Return' part. And I guess, the 'Living'. Being a parent of two kids ages (almost) 4 and 1.5, I'm a zombie. To say I've Returned or am Living is in both cases a gross overstatement. Barely scraping by is a better assessment. But the potential for Returning, and for Living, is something this title gives me─if not <em>hope</em> for─then a loosely positive, you know, slightly more than depressing outlook on the future. </p><p>This blog─which started as a book─is (or will be) chok full of stories about collectively 5.5 years of life with (very) difficult kids. It started as a way to record the crazy shit happening in our lives. Zero sleep, and zero sleep, and also zero sleep. With a dash of terrifying behaviour, awful car rides, tantrums, and defiance. With the effect fatigue and time has on memory, I found my wife and I both forgetting key stuff. We'd literally reverse memories. Tell stories NOT how they happened. Remember things in a positive light somehow. We'd get nostalgic. After the kids were in bed we'd take 2 minutes to unwind, 1 minute to get dinner, 30 seconds to feel the quiet, and then talk about how we missed them. The screaming, the brother fighting, the whining, the resistance, the tantrums, the fight to get dressed for bed: it all evaporated. Time doesn't heal all wounds. It makes you forget them. Especially ones that are trying. Especially ones that involve kids. Which is why when people say \"it goes so fast\" they really mean, \"you forget so much\".</p><p>Which is why I wanted to write some of it down not only so I wouldn't forget, but so I didn't fall into the parent trap of telling someone else going into the fire for the first time that they'll \"figure it out\" or that the first years are \"challenging\". It's rough in here man. Four (five combined) years might not sound like a lot. But it is when you haven't slept for 50-60% of it. When you've been sick for 60-70% of it. It's is when you've had crying, screaming and whining as the sonic backdrop for 80-90% of it.</p><p>The blog takes after the book, which focuses on what you could call the main \"areas\" of life with kids: sleep, behaviour, sickness, the car, feeding, etc. It's essentially a gigantic rant. So much of our lives was (and is) this shoulder raising, eyebrow raising, hair raising, blood pressure raising experience of just fucking not knowing what the fuck is going on or what to do about it. Having had that experience, the eventual goal is to offer ideas, experience, suggestions and insights into the realities of \"parenting\" as I experienced them. With a heavy emphasis on minimal bullshit, maximum reality. I didn't get that when I was starting out. We read the books. But none (or very few, or at least none that <em>I</em> found) of them had a clue. It was sheen and gloss and joy and darling this and rub your baby's back once and they'll drift off to sleep that. My kids didn't do that. They didn't do anything the internet or print media said they would. Ever heard of a sleep consultant? Ever heard of a kid that hates the car? There's a litany of stuff I still shake my head at wondering how the fuck we've made it this far. </p><p>But. Like a zombie movie. We're still uninfected. We're humans. We're Living. If not Returned. And as such there might be something useful in here for others that are wandering through the landscape hunched, eyes half open, not quite a zombie, not quite a human.</p><p>I hope this ends up being the kind of thing that would have helped me before having my first kid. I hope it might be the only “baby blog” parents will need, despite not really imparting any useful information, just a constant stream of difficult anecdotes and real life incidents that have made me want to cry more than ever before in my life. I hope it’s the type of resource that gives parents-to-be a real, yet funny and hopeful (underneath all the dread and fuuuuuck man Jesus Christ almighty stop fucking screaming please fuck, God help me) outlook on parenting.</p>",
      "title": "ROTLD",
      "imageUrl": "https://images.unsplash.com/photo-1637858868799-7f26a0640eb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=880&q=80",
      "slug": "return-of-the-living-dad",
      "tags": [],
      "categories": {
        "cat1": "A place where all the gnarly, gritty, gruesome, and sometimes wonderful things that happen as parents come to light."
      }
    }
  ],
  "name": "Return of the Living Dad"
}