{
  "blog": [
    {
      "imageUrl": "https://images.unsplash.com/photo-1637858868799-7f26a0640eb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=880&q=80",
      "published": "true",
      "title": "The Genesis",
      "slug": "the-genesis",
      "tags": [],
      "categories": {
        "cat1": "A place where all the gnarly, gritty, gruesome, and sometimes wonderful things that happen as parents come to light."
      },
      "body": "<p>It all started as a way to process the insanity happening in our lives. It morphed into a way to <em>remember</em> the insanity happening in our lives. It morphed further into a way to laugh (like in a just to keep from crying kind of way) at the insanity happening in our lives. Then it grew into this.</p><p>Return of the living Dad. It's got two parts to it. First, the zombies. If you're not hip to zombie movies (like me) it's a spoof on Return of the Living Dead. Which itself, is a spoof. At least I think. It's awesome. I watched it purely because I chose the title for the blog. It's got gore, screaming, terror, bulging eyeballs, sweaty people running around petrified, dirty clothes, comedy, classic rock. It's identical to life with kids.</p><p>Then there's the 'Return' part. And I guess, the 'Living'. Being a parent of two kids ages (almost) 4 and 1.5, I'm a zombie. To say I've Returned or am Living is in both cases a gross overstatement. <em>Barely scraping by</em> is a better assessment. But by medical definition, I do currently satisfy the base requirements for being alive. And the potential for Returning, and for Living─a more complete if not less tired existence─is something this title gives me, if not <em>hope</em> for, then a loosely positive, you know, slightly more than depressing outlook on the future.</p><p>This blog─which started as a book─is (or will be) chok full of stories about collectively 5.5 years of life with (very) difficult kids. It started as a way to record the crazy shit happening in our lives. And with the effect fatigue and time has on memory, I found (and find, daily) my wife and I both forgetting key stuff. Like we'd literally reverse memories. Tell stories NOT how they happened. Remember things in a positive light somehow. We'd get nostalgic. After the kids were in bed we'd take 2 minutes to unwind, 1 minute to get dinner, 30 seconds to feel the quiet, and then, with our destroyed, crushed bodies, talk about how we missed them. The screaming, the brother-fighting, the whining, the resistance, the tantrums, the seal-wrestling event that was getting dressed for bed: it all evaporated. Time doesn't heal all wounds. It makes you forget them. Especially ones that are difficult. Especially ones that involve kids. Which is why when people say \"it goes so fast\" they really mean, \"you forget so much and somehow replace the insane meat-grinder of life you've lived through with flowery, wonderful memories that actually don't belong to you.\"</p><p>Which is why I wanted to write some of it down. Not only so I wouldn't forget, but so I didn't commit the mortal sin of telling someone going into the fire for the first time that they'll \"figure it out\", that they'll \"be a bit tired\", or that the first years are \"you know, challenging\". It's ROUGH in here man. Four (five and half combined) years might not sound like a lot. But it is when you haven't slept for 50% of it. When you've been sick for 40% of it. The other 9% is cooking, cleaning, and laundry. Which leaves 1% for all other emotions and experiences. And that leaves out the car-screaming, the general screaming, the tantrums, the hour before dinner that always goes nuclear, the weekends, family events that are double the work of normal life (which is triple the work of family events), the whining, the not eating, the throwing bowls on the floor, the not listening, the doing exactly the opposite of what you asked them to do while looking directly at you while they do it, laughing. There isn't enough percent to accurately convey the full spectrum of life.</p><p>This blog takes after the book, which focuses on what you could call the main \"areas\" of life with kids: sleep, behaviour, sickness, the car, feeding, etc. It's essentially a gigantic rant. So much of our lives was (and is) this shoulder raising, eyebrow raising, hair raising, blood pressure raising experience of just fucking not knowing what the fuck is going on or what to do about it. Having had that experience, the eventual goal is to offer ideas, experience, suggestions and insights into the realities of \"parenting\" as I experienced them. With a heavy emphasis on minimal bullshit, maximum reality. I didn't get that when I was starting out. I still don't get that. You only get a super, ultra real skinny on what happens in the general, day to day grind of parenting when one of your neighbours or friends lapses in a moment of vulnerability or devastating fatigue and tells you something honest. Or if <em>you</em> share something that then triggers them. Or if someone shares on a social channel and gets a zillion \"same here!\" responses out of the woodwork. It's weird.</p><p>When we didn't (and don't) find much for similar experience, we bought the books. Read the blogs. Scrolled through the memes. But very few (or very few that <em>I</em> found) had a clue. The parenting genre is full of sheen and gloss and joy and darling this and rub your baby's back once and they'll drift off to sleep that. My kids didn't do that. They didn't do anything the internet or print media said they would. Ever heard of a sleep consultant? Ever heard of not sleeping for a year? Ever heard of a kid that hates the car? There's a litany of stuff I still shake my head at wondering how the fuck we made it this far.</p><p>But. Like a zombie movie. We're still uninfected. We're humans. We're Living. If not Returned. And as such there might be something useful in here for others that are wandering through the barren, apocalyptic landscape of parenting, hunched, eyes half open, not fully a human, but not yet a zombie.</p><p>I hope this ends up being the kind of thing that would have helped me before having my first kid. I hope it might be the only “baby blog” parents will need, despite not really imparting any useful information, just a constant stream of difficult anecdotes and real life incidents that have made me want to cry more than ever before in my life. I hope it’s the type of resource that gives parents-to-be a real, yet funny and hopeful (underneath all the dread and fuuuuuck man Jesus Christ almighty stop fucking screaming please fuck, God help me) outlook on parenting.</p>",
      "id": ""
    },
    {
      "body": "<p>Loosely speaking, the LOUC goes like this: whatever you do or plan to do (I like to believe this spans anything and everything under the umbrella of ‘planning’) will have other, unknown, unintended results. It can apply to everything and anything. It’s got a lot of Murphy’s Law vibe to it as well. Try to fix your deck, and realize after tearing off the stairs that the whole thing is rotten. Call to get a furnace insurance plan for the included annual inspection then find out you need a new furnace completely. <em>And</em> AC. But it’s exemplified nowhere better than with kids.</p><p>Any plans we make as parents are basically blank slates for other shit to happen. And frankly, it’s not really that the consequences are <em>unknown</em>. We pretty much know what they’ll be.&nbsp; Anything and everything we do ends up being at least in part, a shit show.</p><p>Most if not all ideas we have as parents—which range from experience things like going to the zoo or an indoor gym, to toys and physical things—<strong>tend to simply be problems wrapped in an experience.&nbsp;</strong></p><p>The first problem is logistics. The second problem is behaviour.</p><p>Take the zoo. We have a membership. It’s been great and worth it. It’s always fun being there (once you get there). Until everyone melts and gets tired. But even when we can get my oldest to agree to go to the zoo on any given day, and we actually get out of the house in decent time, we have to deal with the inevitable cascade of trickle-down effects that going to the zoo triggers.</p><h3>First, the drive</h3><p>It’s close to an hour each way. So we have to make sure <em>that</em> bullshit is taken care of: snacks, music, and don’t forget the timing. If we don’t make sure to leave the house at the right time, and then leave the zoo at the right time, we end up (and frequently do end up) driving into/over nap time, which spells ruin. Complete ruin. The <em>experience</em>, my wife likes to say, is worth the pain and hassle. But I will assert that the missed or short or forcibly extended nap because of leaving the zoo late and getting home late, and fucking up the entire rest of the day, and the nuclear fission in the back seat as we drive desperately trying to get home in time to sleep—is <em>not </em>in fact worth it. Which makes me, you know, want to do things less.</p><h3>To the second item</h3><p>We bought my oldest his first lego set for his “3.5 Birthday”. Likely the “half” birthday alone was a dangerous precedent to set. But we’d been watching lego stop-motion animation videos for months and I was stoked to get him started on Lego. I loved it as a kid. And he’s super into construction vehicles. So we get him a lego backhoe. He loves it. He goes wild. But then we need to explain how the Lego building process works. It’s slow, it requires patience (what 3 year old with patience). But still, he’s interested. We start building, following the diagrams and the pages, and he’s liking it. But I made the mistake of starting the build too close to bedtime. He wants to finish. We’re not even halfway through the booklet. I start trying to coax him to put it away and pick it up again tomorrow. Which prompted another “I want Minty” moment, but this time with “I wanna finish <em>iiiiiiiit</em>”.</p><p>I finally managed to get him to sleep. The next morning, he’s jacked and psyched to build. So we build. He did great. We finished it. He smiled. But the issues started to pop up around how it fell apart all the time. Putting pieces back on would trigger other pieces falling off. You have to press the right amount. At the right angle. It’s hard. It’s intricate work. It’s easy to get frustrated. Also he was working the absolute shit out of the backhoe articulating front bucket joint. Up and down and up and down and up and down. I mean, I would do the same thing, but it went on so much I had to suggest he slow down to not break it. And of course, later in the day, the bucket broke. He flipped out. Full tantrum.</p><p>Fast forward a few weeks. We get two toddler sized snow shovels, one for each kid. My oldest likes the ones they have at daycare. We assume they’ll love them. And as it happened, we also assume the shovels will solve the terrible post-daycare total disaster of car-behaviour that usually happens. Which it did. Until it didn’t. We got home, went to the backyard for some snow play. The shovel didn’t have the same action as the daycare ones. The shaft was metal, not plastic. There was so much snow in our backyard—which was not the case at the daycare playground—that it made the shovel too heavy. Which was a big problem. So, there was screaming. And there were threats to take the shovels away. My youngest was getting overloaded and overtired so he went inside. We let him walk around with his shovel in the kitchen. Obviously a hazard with a newly walking—killing it, but still newly walking—1 year old. My oldest then calmed down a bit, wanted to go inside, and obviously keep his shovel too. Which ended up being a hazard for hitting basically anything and everything. The floor, the walls, the cupboards, the furniture, and of course, his little brother.</p><p>We got a great Lego toy, and a fresh new shovel we thought he’d love. Both items got good initial reactions. They were liked. They had impact. But they simultaneously created a host of new problems. This, I’ve come to realize, is the net result of basically anything. And everything. Whatever you do with kids has a hidden result. A Newtonian equal and opposite reaction. If you try to avoid one thing, you just set up another. If you try to do something ultra cool, the thing that ends up in lasting memory is how there weren’t any snacks or enough snacks or enough of the right kind of snacks on the screaming, whining, traffic-laden drive home. And don’t forget the traffic. Possibly the most overlooked of unintended consequences. If you can get stuck in traffic, you will get stuck in traffic.</p><p>The same thing happened another incident when we let him bring his new miniature farm tractor toys in the car. He was happy. He was playing. We arrived at the grocery store. I said it wasn’t a good idea to bring his toys inside. He said he wanted to. It was an immediate fight. So I said fuck under my breath, avoided the battle, and told him he had to be responsible for them himself. He agreed. Of course. Inside it was mostly good. There were laughs. There was illicit grape eating out of the bag. There was choosing dinner from the hot deli counter. Then, we got back to the car. One of the movable parts of his tractor had fallen or broken off. It was nowhere to be found. He <em>lost</em> it. He started screaming immediately. Note that it was also past our traditional witching hour of 5pm and we still had to go pick up the take out we’d ordered for dinner. The screaming was ramping up. I was sure this particular toy part was in his seat, or on the car floor. But I was driving so couldn’t look or find out. I stopped the car at a red light—on a main street—and tried to look. Couldn’t find it. He got even more upset knowing I’d looked and it wasn’t there. We had to drive 10 minutes away to get our takeout. We debated if it was even worth it with the screaming. He kept whining and crying and screaming for the <em>entire</em> trip. There and back. All the way home. And it wasn’t rectified by taking the very same part off his brother’s identical tractor to replace the one he’d lost. It took 30 minutes for him to calm down.&nbsp;</p><p>Every decision is essentially a quantum mechanical multiple possibility situation.</p><p>Of the infinite possibilities, one is good, and one minus infinity are bad. If he brings his toys in the car he’ll be happy. But then he hits his brother with them in the face. And won’t stop. Despite countless demands to stop. Despite reaching back behind my driver seat trying to grab and hold his arm, while driving. And then he brings them into the store. Is happy for 10 minutes. Then breaks the toy, or drops the toy, and is fucking miserable for the rest of the day. The REST of the day.</p><p>This same scenario plays out countless ways nearly any given day. On the drive home from daycare, I suggest we go get ice cream. It’s a Monday. It’s before dinner. Not something we normally do. Everyone cheers! We get to the shop. Order our ice cream. My youngest isn’t interested. Just wants to frantically walk around the sidewalk and put the gross cigarette butt and garbage sidewalk-dirt in his mouth. My oldest then copies him. Ice cream is melting on every finger, every toe, every item of clothing, every surface as they continue to get dirtier. Whining ensues. Crying ensues. We decide to go home. My oldest screams because he wants to stay and just sit and eat his ice cream. Which is understandable. Everyone resists getting back into the car. Once we’re in, everyone screams. And it lasts until bedtime.</p><p>Another day we offer to get burgers and fries for takeout dinner. Everyone cheers! By the time we get to the restaurant the kids are already sick of the car. My oldest is pinching or poking or squeezing my youngest’s face. Which he doesn’t like. My youngest in turn won’t let go of my oldest’s arm. Which <em>he</em> doesn’t like. On arrival, it turns out our order is taking longer than expected. Which no one likes. I drive down to the lake to distract them. It only partially works. We finally get the food amid screaming and whining. We eat fries on the way home. On arrival, we plate the food, they don’t eat much if any of it. And then we go to bed.</p><p>Another day we offer the kids to have a dinner picnic in front of the TV. Everyone cheers! When we get inside and sit down to eat, food goes all over the floor, all over the couch, they get mad touching each others’ toys, getting too close to each others’ toys, getting too close to each others’ space, get mad if the show stops for a commercial, and get mad when it’s time to stop the shows to go to bed. Whining ensues. Screaming ensues. Rinse and repeat.</p><p>It happens when we buy a toy bucket for potty training. When we offer to pick them up early from daycare. When we go to the park. When we go for drives. Every plan, every idea, every thought is simultaneously an opportunity for disaster. And not just an opportunity. An almost certain reality.</p><p>Really it’s not the law of unintended consequences. Consequences become the playing field, the backdrop for every kid related activity. It’s more like The law of certain absolute 100% guaranteed consequences. This is the science behind parenting.</p>",
      "slug": "the-law-of-unintended-consequences",
      "title": "The Law of Unintended Consequences",
      "tags": [
        {
          "category": "life"
        }
      ],
      "description": "Any plans we make as parents are basically blank slates for other shit to happen. Anything and everything we do ends up being at least in part, a shit show.",
      "published": "false"
    },
    {
      "body": "<p>We are constantly sick. In the years since my oldest started daycare we’ve been sick conservatively 50% of the time. Every two weeks on average. At times more than that. Two weeks of health has become both a joke and a reality. Because he was a Covid baby my oldest basically spent the entirety of his life in lockdown. It was great. He never got sick. We never got sick. It was a lollipops and health. I don’t think I had a sniffle. But when daycare arrived. Fuck us. We were fucked. All of us. Constantly fucked. Fucked by sickness. Then when my youngest was born we’d all still get sick. But it would be 4 of us instead of 3. And it’s a longer stretch for another whole person to get over something. A person that didn’t really yet have an immune system. Now that he’s in daycare as well, it’s just a lottery of germs. A lottery we ALWAYS win.</p><p>Yay.</p><p>And now, today, as I write this, I am currently, and again, for the second time in 3 months, with essentially a total repeat of the SAME shit I had 3 weeks ago, which itself lasted 3-4 weeks, <em>sick</em>. And I got it. From my kid. Who got it from daycare. Again.</p><p>And now, again, as I write <em>this</em>, months after the above paragraph, I am currently, again, for the second time in 3 weeks (the second time in a new series of sickness unrelated to the previous paragraph’s series), or really just still, like consistently and unendingly for the past 3 weeks, <em>sick</em>. It’s inhuman. It’s the kind of thing that happens in a Covid open air animal market. Or a virus lab.</p><p>And now, as I return to add more to this section—I am currently, and again, sick. This particular instance was a multi-part journey. It started with Strep throat (which my Doctor assured me I didn’t have, but which the nails and sandpaper and glass feeling when I swallowed begged to differ). After nearly a month of that, it went away, came back, and was all the while accompanied by a sinus cold. The second part was Norovirus. Right now, I am just barely over the crest of a THIRD bout of Norovirus—by far the worst episode of the three—in less than a year. Yes, to answer your question, that’s a lot. It is cruel. Unusual. Torturous. Relentless. Unavoidable. Destructive. Punishment. I’m not joking. It is not a joke. You can only joke about Norovirus if you haven’t had it. Once you’ve had it, you forever fear it. You forever respect it. You never, ever want to invoke its wrath again. Much less three times. Three times in less than a year. Fuck me. And it’s something every kid, and every parent, in the entire household, barre none, gets. Guaranteed. Multiple times.</p><p>Count on it. It’s coming for you.</p><p>This is hands down the worst part of parenting. The sickness. Initially I thought that was a bold, debatable statement. There are a lot of worst parts. Any day, at any time you could roll the dice and come out with a different answer. But not anymore. Not after a third Noro. Not after this one. Being sick while having to parent is the hardest thing I’ve ever done. And not in a like pat yourself on the back, “Hey I got through it!”, “What doesn’t kill you makes you stronger” type way. Like in a fucking Jesus Christ that was the worst weekend of my entire life, hands down, no comparison kind of way. Like in a I’m now less of human kind of way. Like in a I have aged and I will need to recover from this for many weeks, maybe longer type way. More on Noro in a minute.</p><h3>Having kids is one thing. Having sick kids is another thing completely.</h3><p>And being sick <em>while</em> you have to care for sick kids is a third other thing completely.</p><p>My two kids are Covid babies. The oldest is from summer 2019, just before it all went down. The youngest is November 2021, steadily in the BA1 and 2 variant world (plus of course the ever lovely medley of RSV, flu, croup, dry cough, pinkeye, sinus infection, Norovirus, etc).</p><p>My poor oldest son has gotten the shit kicked out of him by sickness the past almost fully 2 and a half years. Bur really longer. He is now 3 and a half. That makes fully 2/3 of his life sick. But he’s sick right now, and has been for the same length of time as me. Which adds another three fucking weeks to the tally.&nbsp;</p><p>Because of lockdown, my oldest son saw no one, interacted with no one, met no one, and was exposed to almost zero germs for almost the entirety of his first year of life. That's pretty messed up. In a way it was great for us as parents. For the most part we didn’t have to deal with sickness, of any kind. It was the same for most of the world. Which is also pretty messed up. But as a longer term thing, immunity only gets developed, obviously, in response to pathogens. In non-Covid times, Moms and Dads on mat/pat leave go out. They take swimming and music classes, they go to malls, they see their friends. But not in the vid times. We did absolutely jack shit. For a <em>year</em>. Aside from drive-through. Just like everyone else. But that also made for a baby that was&nbsp;<em>always</em>&nbsp;healthy, but also with little to no active immune system.</p><p>Enter January 2021.</p><p>We sent my beautiful son to daycare.</p><p>And that was the day it ended.</p><p>It is not a joke to say that since that time—barring the weeks we kept him out of daycare either because he was already sick, or we were trying to get him healthy, or we wanted to go on vacation and not be motherfucking sick—he has been sick. Every. Single. Thursday. Rewind a bit to say he didn’t like daycare. Who would. Bunch of fucking screaming shitty kids sneezing and snotting on each other, hitting, scratching, yelling, pulling, not sharing, over sharing. My wife and I feel badly basically every day at drop off. Badly in a nearly 2000$ a month kind of badly. Like it’s costing us one person’s yearly salary (with two, it’s now two peoples’ yearly salaries) to feel badly and guilty we’re sending him to such an expensive cesspool.</p><p>But the real problem is the sickness. Daycare is fully, totally, a cesspool. It’s literally a place germs grow, develop, mutate, find new hosts, and evolve. It’s a lab. It’s germ central. Everyone is either actively sick, or waiting to get sick. Hands in mouths. Hands on floors. Hands on toys. Hands in food. Hands in bums. Hands back in mouths. As soon as one kid gets better, another goes down. We perpetually ask ourselves, is he sick again? Wait, are <em>we</em> sick again? On spec he's been at daycare probably 50% of the time. We’re basically paying for our son to get sick and stay at home. <em>What value</em>.</p><p>Now that we have a second son, our darling 1 year old, we have another worry. He gets sick from the oldest. Infant sick is less of a joke than toddler sick, which is no joke. Fever, infection, respiratory viruses, dehydration from Norovirus. it’s the stuff of nightmares. And it happened.</p><h3>911</h3><p>Our latest and worst run started at the end of September 2022. My oldest came home from daycare with a sniffle. It grew and developed into a fever, heavy cold and then, the topper: that cough. That fucking unreal motherfucking bastard of a cough. It was dry and post-nasal. And severe. And persistent. Fast forward 2 weeks and he woke up one night with the typical Croup bark, coughing so hard he was struggling to breathe. He was in panic. We were in panic. I am in panic writing about it. We have asthma puffers for him but they didn't seem to be working immediately. We called 911. I took him outside - the cold late fall air and a change of scenery helps we'd read. He calmed a bit but was freaked out.</p><p>Then the ambulance came. It took 6 full minutes to get through to 911. The EMT was a bumbling sort of guy who recommended we take him to the hospital in the ambulance, all the way downtown to the Sick Kids hospital. I'm like, nope, bad idea. But I also want to trust the professionals, so I give it a try. We walk over to the ambulance. It’s ablaze. Blinding fluorescent lights, metal gear, tubes, chrome - not a welcoming or calming environment for a toddler. It would give a rested, well adjusted adult a debilitating panic attack. I made it halfway to sitting down when my son squirms and cringles. I pop back up and say fuck it. We walked out, signed a waiver saying we were forgoing the ambulance service, and drove ourselves to emerg. In the end it was all ok. We got seen, had some meds, left after the triage wait time display increased from 7 hours to 8 hours as we sat there, and came back home.</p><p>But the event was (and is) a moment I'll never forget.</p><p>And now we're in it again. Like so much of parenting, it's groundhog day. We're repeating the sick cycle. Thankfully minus the 911 and croup.</p><h3><strong>Norovirus 1.0</strong></h3><p>A very special section has to be dedicated to Norovirus. It’s worth reiterating that as I write this I am barely over a third iteration of Noro in less than a year. If this doesn’t make the hairs on your the back of neck stand up, it should. It was the most brutal one of the three. Saying I was incapacitated would be a laughable understatement. As with each prior episode, my kids brought it home: this time, it was my youngest son. Poor boy puked his first little 1.5 year old puke early Thursday morning. But there were no real symptoms that followed. He didn’t puke again. He didn’t have the shits. He was obviously sick and uncomfortable and upset. But there didn’t seem to be Noro everywhere. Friday passed without incident. I felt fine. My wife felt fine. My oldest son seemed fine. Then early Saturday morning, my youngest projectile vomits all over my wife’s face. It was only slightly funny as I was focused on running downstairs to answer her low-volume pleas for help so she didn’t wake up our oldest who was still sleeping. Her milk-puke covered face was a little more than slightly funny as I ran to grab our boy so she could clean her face. Which in turn made her puke. After that, she was a shell of person—a ghostly, hunched apparition—for the rest of the day. In and out of bed. White as a sheet. Somehow though, I still felt ok. “Maybe I’ll dodge it” I thought.&nbsp;</p><p>Insert laughing and ironic quip here.</p><p>I’ll preface this by saying I began eating lighter the previous couple days worrying we’d eventually get it. Which is mental. But still. As the saying goes, an empty stomach is a pukeless stomach. No one says that. And it’s not true. And of course, Saturday night I started feeling pukey. 5am rolled around and the barfing began. Because of the empty stomach, nothing really came out. But that didn’t stop the wretching. I moaned. I cried. I heaved. Afterward, I felt horrifyingly bad. Like never so bad. My body hurt. It ached. My heart was racing.&nbsp; And it lasted fully the rest of the day. Which was a Sunday. With two kids. Weekends with kids (of daycare and school age) are far worse than weekdays with kids. It’s 24/7. 25/8 really. And with that as a soundtrack, I lay in bed til just before lunch. Tried to help with kid naps. Crashed again afterward. Sleep did nothing. I just kept feeling like a corpse. If I moved, it hurt. I was constantly nauseous. Every shit was a little rivulet. I literally walked hunched. 45 degrees felt better than vertical. I couldn’t eat. Or drink. Smells made me nauseous. And it didn’t improve. I’d have a sip of water here and there. I feared puking but knew I had to hydrate. It did nothing. I just kept fucking aching. Kid bedtime took every remaining morsel of energy I had. I begged my son to keep it short. “Let’s do 3 books, please my love. Daddy needs your help”. To his credit he was great.&nbsp;</p><p>I only started feeling like I wasn’t going to die after bedtime. I collapsed on the bed for 30 minutes. Then, bless my wife, she went out—herself feeling nauseous and almost like she was in relapse—to get extra strength Advil and a kit of usual sick food stuffs for me. After the Advil and some ginger ale, a sliver of humanity was visible. Barely. I lasted til about 830, then went up to bed.</p><p>The next day, I was through. Tired, pained, low, and at least 5-7lbs lighter. But through. It was harrowing.</p><p>If you’re not already highly afraid and attuned to this especially brutal puke-and-shit-and-fever-and-body-pain festival of a virus, you should get up to speed asap. There is no amount of cleaning, sanitizing, hand washing, clothes washing, sheet washing, towel washing, mask wearing, keeping-home-from-daycare-ing that is too much. And there is really no amount of all of the above that will prevent you from getting it. If it’s in your kid’s class, stay home. For the life of you keep them home. If your kid gets it (they will), <em>you</em> will. Guaranteed. You can’t wear a mask as a parent, and you for sure can’t wear it all the time. And honestly, it spreads so fast, and so viciously, it’s next to impossible to avoid it. You have to literally watch every single thing you touch—taps, hand towels, counters, door knobs, keys, phones, water bottles, and be sure you don’t touch your mouth, and don’t eat with your hands, and don’t let your kid cough or puke into your mouth (happened to me, twice—yes). Which you can’t do, not even for an hour, much less consistently, over days.&nbsp;</p><p>So, best to just know you’ll get it. Multiple times. Count on it.</p><p>And now, in order of severity, here’s a shortlist of the rest of the worst illnesses you’ll absolutely, 100% get by having kids—seriously, again, count on it:</p><h3><strong>Croup/Cough</strong></h3><p>The ill-advised, often misleading, and hard to trust medical websites on the internet suggest Croup is not severe or life threatening. Once you hear that barky cough, and witness your toddler struggling to breathe, and call 911 and wait for 7 minutes for them to arrive, then decide fuck them and drive him downtown to the hospital yourself because the ambulance has the worst anxiety inducing fluorescent lighting and is a place no kid would ever want to be, <em>ever</em>, in the entire history of kids—you’ll think differently. It’s absolutely brutal. It’s frightening. It’s panic inducing. And, it’s severe.</p><p>My oldest developed a pattern of having colds quickly move to coughs. It’s become an expected progression. We didn’t know what was happening for quite a while. He’d start with a basic cold, simple runny nose. He’d snort like crazy (which is its own thing, as mentioned) and then post nasal drip (or whatever aggravation to his airway) would turn it into a cough. And then it would be a cold <em>with</em> a cough. And then the cough would always get worse. Especially in the night. It was (and is) horrible. Eventually the cough would get so bad he’d have coughing fits. I timed it in one recent instance and it was every 3 hours. Sometimes every 2 hours. I’d hear him, check the clock and know we were in for a 15-20 minute event. I’d brace and pucker. I’d clench and tense and get ready for whatever treatment we had next in the pipeline. Tylenol did nothing. The Ivy cough syrup would be a short lived tasty treat with no actual effect. Advil did the best job but would always take 5-10 minutes to take effect so it didn’t help the fits immediately. Then, we had 2-3 instances where the cough turned to Croup. This is the “result of swelling and irritation around the voice box (larynx), windpipe (trachea) and bronchial tubes (bronchi). When a cough forces air through this narrowed passageway, the swollen vocal cords produce a noise like a seal barking. Taking a breath often produces a high-pitched whistling sound called stridor.” This <a href=\"https://www.mayoclinic.org/diseases-conditions/croup/symptoms-causes/syc-20350348\" rel=\"noopener noreferrer nofollow\">reference</a> goes on to say Croup “…usually isn't serious. Most children can be treated for croup at home.”&nbsp;</p><p>Croup, for my son, <em>was serious.</em> It wasn’t treatable at home. I guess I should say it’s treatable <em>now</em>, but that’s because he’s older and has puffers and circumstances have changed a bit. The bark sound when he coughed was INSANE. It sounds exactly like a seal. You don’t even know what a seal sounds like until you hear a Croup cough. It’s frightening for an adult. Imagine it coming out of a toddler. What’s very scary and dangerous about Croup is it can cause the child to have difficulty breathing. The airway gets inflamed, constricted, and the constancy of coughing itself triggers anxiety. And with anxiety comes, you guessed it, more coughing. The 911 story above was traumatic. My son woke up in the middle of the night, struggling to breathe, coughing non-stop. I still have PTSD from it. The only thing that helped was Dexamethasone which is only gettable at a hospital or via Doctor prescription. Since then, we’ve learned to manage it with asthma puffers (Flovent/Orange/“Controller” and Salbutamol/Blue/“Rescue”), which thankfully—in combination with what we think is a slowly strengthening immune system—has helped us (knock on wood) avoid any further instances (as serious as this one) since then.</p><p>If you find your kid gets coughs, with almost any level of severity, be aware of Croup. Watch it carefully, and be ready to ask for and use asthma puffers. I resisted using them. I thought they meant he had asthma. I thought they were “steroids” which were inherently bad. They aren’t. And they work. Anything that works on Croup should be used. And the puffers don’t mean your kid has asthma. And they won’t (hopefully) need to be used forever. They help with coughs and Croup and also help with maintaining better resistance to coughs developing at all. I am now fully on board with them and have seen them help. Obviously this is not a replacement for professional medical advice. But it is the experience of a parent who’s been to a family doctor and 5 paediatric specialists about it. Whatever that’s worth.&nbsp;</p><h3><strong>RSV (Respiratory Syncytial Virus)</strong></h3><p>We haven’t actually had this (as far as we know). Most kids apparently get it, whether they know it or not, by age 2. Adults get it too. But symptoms apparently mimic the common cold. The reason I’m putting it here so high on the list is that it can be severe—and can have symptoms similar to Croup. RSV can be severe in babies under 12 months, anyone with compromised or weak immune systems, and older adults. The big threat, as far as kids go, is that it can make them struggle to breathe.This is no small matter. <em>Symptoms in severe cases include fever, severe cough, wheezing — a high-pitched noise that's usually heard on breathing out (exhaling), rapid breathing or difficulty breathing — the person may prefer to sit up rather than lie down, and even bluish color of the skin due to lack of oxygen (cyanosis).</em></p><p>You can understand how this would be fucking terrifying. It was for us with Croup. It’s also why every parent from about 2021 to 2022 was afraid to get it. RSV tore through children post-Covid, and caused many to be hospitalized. For a while it was the main virus going around daycares and schools. We worried about getting it and knew people that did. Thankfully nothing terrible happened in our immediate circles. But RSV is one to watch out for.</p><h3><strong>Norovirus 2.0</strong></h3><p>Norovirus could (and maybe should) outrank croup, but because it’s just a shitty, shitty pukey brutal fucking time and doesn’t affect breathing or make you sound like a seal asking for fish, I’ve ranked it at #3.</p><p>Also, I just had it. As I write this, I actually still have it. This is how fast it came on. My oldest had a gigantic shit. I went up to change him. It poured out of his diaper. He gave no sign anything was amiss. I had to give him a little bath to fully clean up. He continued to be outwardly fine. No puke. No symptoms. I guessed it was something he ate. Within a day I went from totally fine to a tiny bit stomachy, to a having a couple questionable shits, to feeling like I for sure had it. Within a half hour from that, I was praying I wouldn’t puke. I got instant chills. I put a second hoodie over the one I was wearing, put both hoods up, on top of a toque, over which I put my bathrobe. And I was still shivering. Within a few more minutes, I was doubled over the toilet, eyes closed, breathing heavily, moaning—<em>moaning</em>. I puked until I had no liquid in my body. I roared. It was like a high school level hangover puke. Afterward, I felt moderately better. Just in that kind of way where you t least know you don’t have anything left to barf. And I had enough energy to go downstairs to help out with the last remaining minutes of my kids before bedtime.&nbsp;</p><p>But when I got down there, all I could do was lie in a weird angle on the couch. Any movement made me feel sick. My best friend, my most cherished and trusted possession was a plastic bag in my right pocket. That and half a roll of toilet paper in my left. It was like a toddler’s blanky. It made me feel secure. I could puke anywhere. Finally, I ran back up for one more barf session. It was terrible. But then, finally, when even bile was ejected, the worst of the puking was done.&nbsp;</p><p>After another day of not feeling super duper great but mildly better, I got a second wave. This time from the other end. Sparing further details it wasn’t a 24hr affair. And it wasn’t fun. And it was the second time I’d had Noro in less than a year. The last time I had it I recall never, never, ever, EVER wanting to get it again. This time was the same.</p><p>Personally I rank Norovirus as the top shit (and puke) show for parents. Be on guard. And be afraid.</p><h3><strong>Fever</strong></h3><p>Fever, especially in infants is no joke. It can be bad for a lot of reasons. A fever under 2 months is considered an emergency, and reason to go to the hospital. And it’s hard to take kid temperatures. I do it at least 3-4 times per ear and take an average. That’s if they’re not burning up so much you can just feel it. There’s infant and children’s pain killers which manage fevers which we again started out being wary of, but learned to use <em>liberally</em> when needed.&nbsp; &nbsp;</p><h3><strong>Covid</strong></h3><p>Seems funny to put Covid this far down the list. But as we knew relatively early in the pandemic, Covid was generally and thankfully mild in children without other respiratory or immune complications. The worst of the symptoms was fever, which as above is serious but generally passes in a couple days. The worst part of Covid in children is Covid in adults: transmission is very <em>very</em> hard to stop once it’s in the house. Especially with the kind of contact you have as parents. And obviously getting it as an adult comes with all the lovely difficulties we know and love.</p><h3><strong>Pinkeye (Conjunctivitis)</strong></h3><p>Both kids have had pinkeye a couple times. It wasn’t serious. The worst of it was consistent discharge like sleep in both eyes. They didn’t get super pink. And it didn’t spread to us. It spreads through touch, sneezing/ingestion, or touching an infected object or surface, then touching the eyes. It can be more serious with lots of itching and more discharge, but generally it’s not a massive threat. It spreads easily and usually means having to stay home from school/daycare for a few days until it passes.</p><h3><strong>Strep throat/Bacterial Pharyngitis</strong></h3><p>Strep throat does not deserve to be the last entry on this list. It could easily be in the top 3. It apparently occurs rarely in kids under 5, but fuck me does it ever occur in <em>parents</em> of kids under 5. To say I just got over Strep would be inaccurate on two counts: 1) according to my Doctor, I had <em>Viral</em> (not bacterial) Pharyngitis, so it “wasn’t strep”, and 2) I still have it. After 4 weeks, and now into a 5th, I still have a sore throat. It’s evolved so I can’t say it’s still Strep but it was fully like swallowing nails for a solid 3 weeks. And when I say like swallowing nails, it was like swallowing shards of glass. As well as nails. And when I say it was “like” that, I mean it was literally like that. It fucking killed. Every swallow. Liquids. Solids. Saliva. Air. Fucking. Killed. In the 4th week it downgraded just slightly to swallowing sandpaper. And the 5th week is now like I just puked and my throat is all irritated and acidic. Which is in fact true because in addition to Strep, I just barely got over an especially brutal episode of Norovirus. Where all liquid was purged from my body via my mouth. So my throat right now is like an angry, red, swollen, broken, ravaged tube. I will say that even as I slowly, slowly heal (I hope), I should in this moment still go back to my Doctor to kick his ass. If you get a proper diagnosis for Strep which is bacterial, you’ll get antibiotics which should kick it. Regardless, as with most things on this list, you’ll probably get it. But if you can, I highly suggest avoiding.</p><p>And there you go. A taste of the constant circus of sickness that is life with two kids under 4, and a short list of the worst illnesses you and your kid(s) are 100% likely to get.</p><h3>A new \"hope\"</h3><p>This all being said, I heard a story recently that gives me if not hope, then pause. Or at least cautious optimism.</p><p>A friend has a school age kid (4-5+), that went to daycare. He has a friend the same age that did NOT go to daycare. This non-daycare kid didn't get exposed to the petri dish of fun he did, or we did. It spared him (and his family) the harrowing, constantly repeating horror movie of sickness we lived through (and are living through) up to age 4 (and now, and now and now). </p><p>But now that he's in the thick, dense, dark forest of disgusting school and toddler germs, he's getting PUMMELLED. And while I don't have further details, I can say that I feel (slightly) conflicted as I stifle a chuckle. I mean, I don't wish the immense pile of sick we experienced on anyone. And it's awful at any age. But hearing that going to daycare and living through the snot and germ madness we did was actually worth something makes me take a deep, kind of satisfying breath. It's a sliver of vindication.</p><p>If there's ANYTHING we deserve after all this time, it's a morsel of hope that (I cringe as I write it) <em>things will get better</em>. </p><p>Apparently anywhere from age 5 right up to grade 1 (approx. age 7) it starts being less brutal. I won't hold my breath on that, but here's to hoping.</p>",
      "imageUrl": "https://source.unsplash.com/1200x600?baby,cough",
      "published": "true",
      "slug": "sickness",
      "title": "Sickness",
      "tags": [
        {
          "category": "illness"
        },
        {
          "category": "health"
        }
      ],
      "date": "Monday June 5, 2023",
      "description": "We are constantly sick. In the years since my oldest started daycare we’ve been sick conservatively 50% of the time."
    },
    {
      "body": "<p>My oldest is almost 4. He isn't potty trained. It wouldn't be a big issue if it weren't for a couple things.</p><p>He graduates daycare in a month. For the summer, we've enrolled him in a camp. They'll be off-site most days which means potty training is fairly essential. Second, he starts junior kindergarten in the fall. Potty training isn't technically required, but it's kind of a given. On top of those, it's starting to sort of be a thing. A lot of his friends at daycare use the potty. Some (many) are younger than he is. His teachers are trying to help but say he's not interested. Meanwhile, 50-75% of the time he delays, resists, or outright fights changing his diaper at home. As he gets stronger it's getting harder and more annoying trying to hog tie his legs while wiping his butt. And when he fights me, it takes all my faculties to stay calm and tell him that if we used the potty, we wouldn't have to do this whole charade. It's also getting a bit old being out places and having giant shits to deal with. I love him to death and I'm not in a rush. I don't remember 4. I don't recall using diapers vs potty. I don't recall caring. I don't think it's a giant deal just yet. And I have a couple friends who've had similar experiences. Generally I'm not super worried. Plus my youngest is still 1.5, so it's not like we're not used to it.</p><p>But there's a bigger problem. He just doesn't want to do it. And that's putting it lightly.</p><h3>Oh Crap</h3><p>Let me back up a tic. About a year ago, we gave potty training a try. It was a nightmare. It scarred us all. We tried the \"Oh Crap\" method. It's a book. The core of it is to take a weekend, stay home, don't go anywhere. Leave the diapers off. Put potties in multiple locations. Make access easy. And let them walk around naked. They can piss and shit as they may. You encourage them to notice when the urge strikes. And try to get to a potty when they do. Sounds simple enough.</p><p>It isn't.</p><p>First, getting a kid to even be interested in the potty, much less sit on it, isn't easy (if it is or was for you, bless you, please pay your good luck forward). A plastic toilet might be new and shiny at the start. But it doesn't stay that way for long. You have to work at it. You have to bait them. Goad them. Entice them. \"Make it fun\". Come up with \"rewards\", get potty books, potty toys, think of strategies. Diapers in contrast, are easy. They're comfortable. They're safe. They're habitual. Changing that dynamic in itself is a challenge.</p><p>Second, you don't hear about how hard it is to just sit at home all day to wait for any type of potty production. And not just waiting, but waiting while being overly positive and supportive of every tiny little <em>everything</em>. Yay you noticed you have to go. Yay you peed on the floor. Yay you noticed again. Yay you pooed on the floor. Yay you ran around the kitchen peeing. Yay you looked over in the general direction of the potty. Yay you sat on the potty. Yay you peed in Daddy's face. Yay.</p><p>And while sitting on the potty is a success, KEEPING them on the potty, for even a minute, is difficult. In fact every aspect is difficult. At least it was (is) with my toddler. We celebrated every micro inch of progress, every even <em>mild</em> amount of interest. \"Is this working?\" Will it happen? Will it improve? And after the initial semi-mild potty-curiosity wears off, your kid realizes what's actually happening. He understands that he's going to be expected to <em>keep </em>using the potty. He's going to have to <em>keep</em> having to piss and shit in his underwear. Or on the floor. Until he gets it into the potty. And he starts to understand that it's not actually super fun.</p><p>But the real problem was any mild interest or moderate curiosity for potty training evaporated after the first day. He started day one not too bad. He wasn't really happy about it, but he wasn't totally resistant either. It was new. We tried to make it fun. We had his diaper off. He was playing. And we sat around waiting. We started recognizing pre-signs, he'd have pees on the floor, it was going sort of how we thought it might. He had one small but successful poo. We were excited.</p><p>Then it got worse. The second day he had less interest. He realized he had to do it all over again. He wasn't nearly as excited. And since he wasn't really excited the first day, we were more or less into the negative on day two. Then he started resisting. Didn't want to sit. And we realized he was holding in his shit. And his pee. He was starting to hurt. He was obviously uncomfortable. He didn't want to go. Didn't want to keep having to do this fucking thing. Just let me live like a human. Let me have some dignity! Please!</p><p>He'd show signs of having to pee. Or just start peeing. And he'd cry. He'd get upset. He'd start to buzz and shake and hop and not know what to do. But not in a funny potty-book kind of way. It was uncomfortable. He was scared. He didn't like it. We'd be positive. We'd try to usher him over to the potty. We'd say \"Yay, way to go! Come on over to the potty!\" Which he didn't want to do. He'd resist. A few times we'd get him onto the potty early. He'd sit and wait. But just for a few seconds. When he actually felt the urge, he'd want to stand up and get away.</p><p>In what became his final try, he felt a pee coming. He sat down on the potty willingly. We were positive. And as before, when it starting coming out, he stood up. The pee started going everywhere. Mostly on me. He didn't want to sit and actually wait for it come out. And so, in a moment of frustration, after a day and a half of trying to make it work, after countless ups and downs, after pleading and begging and trying every tactic, I tried to hold him on there. I forced him down. I fought him to stay. All I wanted was to have him get the pee in the pot. It was coming out after all! It was one of the worst things I've done.</p><p>I am still ashamed. I am still horrified. I feel immense regret. Still. A <em>year</em> later.</p><p>He screamed. He cried. He sobbed. Big, wet, giant tears came down his face. He was outside of himself. He was so upset. He was probably embarrassed and ashamed and angry and horrified and betrayed all at once. I want to cry as I write this. I feel so much guilt. I feel so ashamed I did this. I was just at the end of my rope. \"It's just pee! Just sit! Just let it out! Just stay on it. You're already there! It doesn't hurt.\" My rational mind was on fire. But of course, no logic is happening in a toddler's mind. Not in a moment of immense stress. Not in a moment iof immense calm. Not in any moment. There's no rationale or analysis. Just emotion. And reaction.</p><p>After this moment, I looked up at my wife and said \"I'm not doing this anymore. This is over.\" She agreed before the words were out of my mouth. Said it almost in unison. We went straight upstairs, put on a diaper. And hugged him.</p><p>The three of us (my youngest hadn't been born yet) were traumatized. I still have PTSD. I think he does too but haven't actually tried to relive the topic with him. It was a horrific experience. He even got a UTI from holding in his pee and we had to take him to the Doctor. I may not ever forgive myself for acting the way I did. And I vehemently suggest parents do not use this method. Or if you do, be sure you have the right kid, at the right age, with the right support, monitor how it proceeds, and be ready and willing to pull the plug at any time. Oh, and take it from me, don't force your kid to sit or stay sitting on the potty.</p><h3>A year later</h3><p>The (added) difficulty now is that he's a year older. He's smart. He's aware. He's emotional. He's insanely observant. He has an amazing memory. He hears everything. And he has social pressure from knowing he has friends at daycare that use the potty. The Oh Crap approach—and really <em>any approach</em>—doesn't account for a toddler who doesn't want to try. Who doesn't want to take off his diaper. Doesn't want to be naked. Doesn't want to pee or shit on the floor. Doesn't maybe want to pee or shit anywhere. A toddler that is private, sensitive, and shy. A toddler that is resistant, reluctant, defiant, strong, avoidant, and stubborn. And a toddler who is a little bit, maybe a lotta bit, afraid.</p><p>For the uninitiated, you cannot force a toddler to do much. A few things will work (for a while, sometimes). Getting dressed. Putting on shoes. Getting into the car. Going upstairs to change a diaper when they don't want to. But they all require physical force if they refuse to go willingly. I have to pick him up while he wails and screams and whines and goes boneless and sometimes hits. But when it comes to the potty, it cannot be done. \"You can lead a horse to water...\" is the expression that came <em>after</em> millennia of parents saying \"You can lead a toddler to a potty...\" over a double (triple, quadruple) whisky in the local saloon.</p><p>And you obviously can't physically force anyone—toddler or adult—to pee or poo on command. And you certainly can't force <em>my</em> toddler to do it.</p><h3>Avoidance, regression</h3><p>What happens now when we brooch the subject is twofold. He avoids it. At all cost. He avoids eye contact. He avoids any talking about it. He physically will move his body, around, away, up and down, to express his dislike. He's so clever he'll try to point MY awareness to something else. I'll bring something up while changing a diaper. He'll point to his closet and say \"hangar\" or \"I like those\", he'll put his head down and look at something, grab a toy, do anything to make it stop. When we do occasionally get through to him, he so far has only admitted that he's scared. How? Why? What about? We can't get any more detail out of him.</p><p>The potentially more difficult behaviour is regression. It's kind of crazy witnessing a 4 year old acting younger than he is. It's a normal part of toddler development. And it's something he'll do around his younger brother, usually as a joke, or to get attention, or to imitate. But this potty training scenario is more like he's just incapable of being in the current moment and turns back into a younger child. He sucks his thumb (which he still does but it's more about the context), talks in a kind of baby-ish tone, and again avoids any discussion of the topic. It's one of the biggest most frightening life changes he's encountered thus far. And if he does remember last year's Oh Crap debacle, then we're asking him to relive a very stressful, painful event.</p><h3>What we're trying now</h3><p>Now that' we're feeling pressure to get things moving, we're trying to bring potty training more into our daily awareness. We don't really know what to do. Because we have this history, whether he remembers it or not (I think it's in there somewhere), and because he's feeling more pressure from daycare, and us, we can't do all the first-timer shit that you read on the internet. \"It's gonna be fun! You're a big boy now! You get to wear underwear! You don't need diapers anymore! You get to be naked!\"</p><p>None of that works. None of it reduces the fear. And he KNOWS the reality. He won't be fooled into thinking it's gonna be fun. A lot of blogs like to give 10 or more tips for potty training. And you guessed it, 10 or more of them don't work. Again, at least not for us. Below are some of the most common ones, as well as a few ideas that as yet are untested:</p><p><strong>Bribery/Rewards</strong></p><p>We've tried bribery. We got him M&amp;Ms as a reward <em>only</em> for when he sits on the potty. We got him a bucket of toys: he can have one every time he sits on the potty. We bought potty books. Other internet suggestions are to have stickers, candy, iPads, stuffies, etc. None of it has worked.</p><p><strong>Desensitizing</strong></p><p>We're trying consistent exposure or desensitizing: I'm trying to take him into the bathroom with me when I pee (and sometimes poo, yes it's modelling). The goal is to make it a habit to just go in. Make it not scary. I show him it's private. It's safe. It's quiet. There's no pressure. I'm trying to start going in first thing in the morning. And at night before bed. So far, I haven't been that consistent. And so far he's not that interested.</p><p><strong>Interaction, engagement</strong></p><p>I've tried dumping his poo from a diaper into the toilet and getting him to flush. Flushing's fun, right?!. He usually wants <em>me</em> to flush it.</p><p><strong>Underwear</strong></p><p>The prospect of wearing cool \"big boy\" undies is often mentioned as a good motivator. \"Now that you use the potty, you can wear UNDIES!\" Enter cool patterns, colors, shapes, diggers, space stuff. So far it hasn't worked.</p><p><strong>Independence, end of the change table battles</strong> </p><p>Increased independence as a motivator is a regular feature on potty blogs. I've repeatedly tried selling him on the idea that using the potty will remove the need for diaper changes. Yay! In those many many (many) moments of terrible fighting before, during and after diaper changes, I've gone on at length that if he used the potty, there would be no more diapers. Magic. Ta-da. It hasn't worked.</p><p><strong>Deadline</strong></p><p>We haven't formally tried giving him a timeline where we'll stop using diapers, but this is another suggested tactic. We tried saying \"Oh, we've run out of diapers and the store doesn't have any more...\" Which he knows is a lie. \"Where do all the other ones we always get come from? Suddenly no one has any?\" I don't like being deceitful, especially when he's savvy, but there is some (very) loose potential in this one for at the very least giving him a drawn out timeline for transition. I don't see it working, but we'll see.</p><p><strong>Underwear = diapers</strong></p><p>I've tried talking to him about underwear being the same as diapers. It's not maybe the best to <em>equate</em> them, but I want to give him a way to transition away from diapers. Undies occupy the same amount of space relatively, are soft, comfortable, and look cool. So far this hasn't worked. But I've only suggested it once or twice. If I combine temporarily running out of diapers AND replacing them with undies, there might be a crack of daylight to work with. Doubtful. But maybe.</p><h3>Other potential options</h3><p><strong>Habit</strong></p><p>Similar to desensitizing, I'm starting to think the only way to do this is to slowly build a habit. Go into the bathroom consistently. Whether he sits on anything or not, he's in there, he's in the zone, he's close, and can just be in the potty space. This morning I took the potty seat we have that covers the adult toilet and put it on top of the closed toilet lid. I asked him if we could see if it fits his bum. I wanted to make sure it wasn't too big. It wasn't over the open toilet. It was safe. It was ok. And of course he didn't want to. So I put the seat on my lap. Tried to get him to come up willingly. Which he didn't. But he sat on it for a couple seconds when I just picked him up and plopped him down. Possibly offering an immediate reward for this could be something to start with.</p><p><strong>Change all diapers in the bathroom</strong></p><p>It could be something to start changing all diapers at home in the bathroom.The small potty will be there for reference. The big potty will be there for reference. Neither need to to be used specifically. But we can try sitting on one or the other at each change. At minimum we start to equate diaper changes with the bathroom and potty time. And an added benefit is he doesn't have to lie on his back on an ever shrinking change table while I hold his legs in the air. Plus the bathtub is right there if we need it. </p><p><strong>Incentivize</strong></p><p>We could offer treats and toys and potty rewards, without strings or requirements, at each change. Because we are having no success by giving rewards AFTER potty attempts (because we have no potty attempts), we can try giving a reward before and/or during. If we're already inside the bathroom doing a new-style diaper change, we can have a treat of some kind to maybe increase overall positive association.</p><p><strong>Too much talking</strong></p><p>Toddlers are children. They're smart. Curious. Resilient. And amazing. But they're still children. Modern parenting gives them a lot of responsibility and power. And again, no one, of any age, can make anyone else, of any age, piss or shit if they don't want to. And logic is not something that is governing a toddlers mind. Especially when it comes to an <em>emotionally</em> charged issue. So in our search for answers, it almost entirely falls back to talking. Should we try this? How do you feel about this? It's time we do this, what do you think? In our family, we talk A LOT. There is a lot of reasoning. Analyzing. Discussing. Emoting. But in this case talking is not working. He shuts off. So, let's stop doing it.</p><p><strong>Fear</strong></p><p>By far our biggest challenge is fear. He may feel any or all of: age related shame, social related stress and anxiety, fear of not knowing how, fear of literally falling into the toilet (our toilets are elongated chair height and are big for adults; he's also told me he's afraid of falling in), fear of pain and getting another UTI (as he had our first time we tried), fear of losing a part of himself when the pee or poo actually physically leave his body (apparently a real thing in kids), and more. The fear is so great for him he won't even engage in discussing the subject. This is where we need something that works.</p><p>Our potty training version 2.0 is in fact kind of underway. While we didn't officially announce anything (why would we, what has that ever done for us?), potty training is in the atmosphere. It's a thing we talk about. We watch the cartoons. And maybe that's all it has to be. Maybe it's not something you plant a stake in the ground for or announce on Twitter. Just <em>start</em>. Slow. Steady. It might be something.</p><p>Time will tell. </p>",
      "imageUrl": "https://source.unsplash.com/1200x600?toilet,toddler",
      "published": "false",
      "slug": "potty-training",
      "title": "Potty Training",
      "tags": [
        {
          "category": "potty training"
        }
      ],
      "categories": {
        "cat1": "potty training"
      }
    },
    {
      "body": "<p>From filters to staging, angles, lighting, poses, makeup, muscle flexing, backgrounds and even just that squinty, blue-steel look into the distance, people often (always, constantly) use social media to convey an \"idealized\" version of reality. And of their lives. If you think it's any different for parents, think again.</p><p>If you’re not familiar with the Instagram vs. Reality trend, somewhere just before or around the start of Covid, people started posting side by side photos on social media—primarily <a href=\"https://www.instagram.com/explore/tags/realityvsinstagram/\" rel=\"noopener noreferrer nofollow\">instagram</a>—which showed two contrasting versions of the same event: on the left, a glorious glowing photo of something extraordinary. On the right—what <em>actually</em> happened. It showed the ideal setting and persona someone was trying to portray versus the reality of where and who and what they were. For example: you’d see on the left two beautiful, fit women in bikinis with pouty injected lips coyly sipping a cocktail on the beach. On the right, candid, unfiltered photos of the same scene show the same two women—not nearly as fit, not nearly as smooth-skinned, not nearly as attractive, with no makeup, no drink, and no vibrant, overly contrasted colors, just standing on the sand like lost tourists or students waiting for the bus. </p><p>Other images show more sensational differences—everything from movie and pop stars with obviously photoshopped bodies and filtered faces, to—more to our subject—Mothers and parents having the <em>time of their lives with kids</em>. Oh ya. It’s all smiles and laughs. All the time. “I’m just a Mom who loves her kids, doing yoga, living her best life. Oh and did I tell you about my new small business and the patent I wrote by myself for my new product? #momskillingit”. Don't get me wrong, this does happen. Some parents might be having the time of their lives. Some might be starting a small business. You know, in addition to having a brand new infant (and maybe even a toddler), and a full time job, while, you know, writing patents on their own for the new product they invented. It's possible. It happens. Not to me. Not to my wife. Not to anyone I know. We didn't have any fucking time to be starting small businesses. Or writing patents. Or <em>thinking</em>. A raging toddler and freshly baked baby don't lend themselves naturally to <em>free time</em>. Much less a good time. Much less a filtered instagram post about #winning.</p><p>In this context, the disconnect between where people are and where they want to be is pretty cavernous. Which is kind of the way life actually is. Ever been to a cocktail party? A high school reunion? Of course, there's nothing wrong with winning. Or with wanting to be winning. I want to win. Everyone wants to win. Everyone wants to be better. Everyone wants to <em>feel</em> better. Be more successful. Be happier. Have more. Feel more secure. More powerful. More fun and cool. Parents included. Maybe parents <em>most of all.</em> </p><p>But social media doesn't really exist to connect with high school friends or stalk old sweethearts. It exists to show the world the self you wish you were. No one posts ugly, tired, stressed, depressed, fat photos of themselves. Or at least most people don’t. Unless it's a cute, fit, or intentionally ugly, tired, stressed, depressed fat photo of themselves. Everyone wants everyone else to think they’re successful, good looking, in control, on top, doing what they want, how they want, where they want. The instagram vs. reality trend pulled back the curtain, at least partially, on how much lighting and filtering and angling goes on in the world—or at least in the world of social media—that passes for reality. No one wants to fail. Or to suck. Or to be down. Or to have nothing interesting happening in their lives.</p><p><em>Which is pretty much exactly what happens when you have kids.</em></p><p>Kids are brutal. Having kids is brutal. They're glorious and a miracle. But. They're brutal. It should be common knowledge. From the start. The whole happy hippy \"It's an adventure, we'll figure it out\" thing is true. But also absolute and utter bullshit. <em>Everyone</em> figures it out. You figure it out by grinding your teeth into powder every night while your kids alternately whine and cough and cry and don't sleep and wake up so early you can only survive by drinking 5 double espressos before 9am. </p><p>It's been done before. Kids have been made. Parents have done it. It's just that everyone who has valuable intel on the subject (see <strong>Sunshine and Moonbeams</strong>) is either too tired, too hateful, too old, too destroyed, too afraid to look weak, or too spiteful to talk about it in any way that might realistically help fresh young idiots getting into the game. Or old idiots for that matter. It's also that the 3-trillion dollar human evolution keep-the-species-going baby-industrial complex doesn't want you to know that having kids is utter insanity. Beautiful, glorious, loving, incredible, enriching, brutal insanity: “Look at all the photos of happy joyous families with perfect babies in this amazing stroller that quadruples as a car seat, playpen, crib, AND grocery cart—which just happens to be the product of a single Mom who developed the idea while on mat leave with her third child and wrote her own patent: #momskillingit”. Again.</p><p>Almost from the get go with our first son, it seemed like the hard time we were having was \"just us\". Every social post, photo setup, ad, or blog about kids and parenting are pumped full of joy and miracles. Everything's fucking golden. All the time. If you were to believe the books and blogs and social channels, no one has any problems. If they do, they're cute problems like “My kid hugs other people too much”. Or “My kid falls asleep in the stroller too easily: I wish he was more social.“ <em>Very</em> sad.</p><p>We had large difficulties from the start. Namely feeding, weight gain, and sleep. My first son had either colic or an aversion to both breastmilk and formula(s), and we had trouble with breastfeeding, supply, latch, tongue tie, etc. He would eat, arch his back, scream, wail, cry, take another sip, fall asleep, and repeat. He didn't gain weight quickly. We had to buy our own scale. We had myriad early Dr. appointments. Our relatively young Doctor made us worry about weight gain (needlessly) by booking weekly appointments to check weight gain. We worried like fucking hell. We barely slept. He barely slept. It was fucking awful. Add to this we were having our home renovated before and after we came back from giving birth. The reno continued another 5 months with a team of Scottish, Irish, and Aussie workers in our house every day after he was born. It was brutal and it had a terrible, stressful impact on us and pretty much the whole first year of our son’s life.</p><p>But as the internet and our friends with similar age kids would have it, everything was great. Feeding was easy. Sleep was easy. Behaviour was easy. \"Let me just whip open my handy dandy <em>Park Napper 2000</em> and put my kid down for his nap in the middle of this insanely loud outdoor birthday party next to a water park on Canada Day! She loooooves napping in loud settings.” And we only learned later and after much texting and prodding, that it was all bullshit. Everyone was having a hard time, albeit in different ways. Some had an easier time at the start, but got harder as time went on. In the end, the flawless, perfect image with the no-prob, all-good version of parenting was actually not so. But for some reason, no one talked about it. Especially as I saw it—the Moms.</p><p>I was amazed to find so little on the expansive internet that talked openly and honestly about the general difficulties of early parenting. And also the specific difficulties of difficult children or children having difficulties with basic things. Even in the annals of the semi-culty sleep consultant groups, there was little other than the oft-repeated lists of things that can help a baby that sleeps like shit (or doesn't sleep at all): blackout blinds, white noise, calming music, regular wake/sleep windows, sleep sack, changed diaper, enough food, routine, etc. No one had anything more to suggest if all of that shit <em>still</em> didn't work. Which it didn’t.</p><p>Only maybe twice did we meet parents who were brazenly and also frighteningly real. At a craft brewery one summer, what turned out to be a Mother saw us at the neighbouring table with our then one year old. She said something like \"enjoy this time, it only gets harder\". Another was a Mom at a local beach who had two boys roughhousing in the water. She saw our two under 4 and said \"I loved that age. Now I spend all my time trying to stop them from fighting.\" Part of me wanted to cry - the other part wanted to laugh and say fuck, thanks, finally someone who's honest.</p><p>Having kids is brutal. I'll say it again. Maybe more so if you're an older parent. And it's brutal for a lot of surprising reasons, not just the usual shit. The oppositional, defiant years of 3-4, are a constant, <em>constant</em> test of will and sanity and strength. The screaming, the tantrums, the totally mercurial mood swings, the hating the car, the not wanting to get into the car, the wanting to “do it by myself”, the time it takes to get into the car, the reluctance to do anything at all. And that’s not even touching teenagery.</p><p>We still take a zillion photos and pull out the few where everyone is smiling. But the ones where the oldest is about to hit the youngest, or where the youngest is crying while the oldest eats a freezie are pure gold for their realness.</p>",
      "imageUrl": "https://source.unsplash.com/1200x600?reality,abstract",
      "published": "true",
      "slug": "instagram-vs-reality",
      "title": "Instagram vs. Reality",
      "tags": [
        {
          "category": "Instagram vs. Reality"
        }
      ],
      "date": "Thursday May 18, 2023",
      "description": "The 3-trillion dollar human evolution keep-the-species-going baby-industrial complex doesn't want you to know that having kids is utter insanity."
    },
    {
      "body": "<p>One of the things that continues to boggle me, one of the reasons I started writing in the first place, is the miracle that is people talking <em>at</em> you about how to do things with your kids. Like putting them to bed, brushing teeth, driving, eating, and other behaviour type stuff. Matter of factly telling you what works, how it's done, and what \"should work\" if points A and B don't. It's like every profession, every service, every product has the same patter about how to get your kid to do something. Doctors, nurses, daycare staff, kid store clerks, friends, other parents, and sometimes Grandparents. We ran into a classic scenario recently.</p><p>We took my youngest to his first dentist appointment. After the initial chit chat, they got into how we should be brushing. He resists it, we tell the hygienist. He's strong. He likes to hold the brush himself. He won't let go. He doesn't like letting us do it. She proceeds to pull out a monkey with dentures. It's for a brushing demo. Yay. She's maybe 23. Apparently has a kid of her own. Puts the monkey on her lap, facing forward like she's going to read it a story. Tells us to brush front to back. Put our fingers in his mouth if he won't open up. After 5 seconds I was shaking my head. \"That won't work\" I say. I smile. She changes tack. Puts her knees close together and lays the monkey down on it's back. \"You can also try laying him down so you can see his...\" That won't work either, I say. Not a chance.</p><p>Have you <em>really</em> done this before? With actual toddlers? Uh-hunh. And have you done it with a toddler that has even the slightest defiance? The slightest I WANT TO DO IT MYSELFness? The slightest insistence you don't do it or touch their mouths? The tiniest resistance to brushing their teeth? I didn't think so. What then Ms. Monkey demo? What if the kid doesn't even want to lie back on the crazy frightening dentist chair with the crazy frightening fluorescent lights blaring in their eyes, with the crazy frightening hygienist goggles and dentist headlamp looming over their little faces, with the crazy intense Peppa Pig on the massive screen over their faces intended to calm them down?</p><p>Needless to say, they couldn't do a cleaning. He wouldn't lie back. He wouldn't stay still. He torqued and twisted. I'd do the same. The dentist had to basically hold him down and force her steel torture utensils into his mouth. Poor boy.</p><p>So no. We didn't get any further Gold Star advice on how to do it from the people who've \"done it before\". To be fair it was his first dentist visit. It was new and scary. He might warm up next time. I doubt it. But maybe. And the clinic is pediatric-only, so they <em>should</em> generally know what's up. And like doctors, there are things in life that are NEVER fun and NEVER not-scary and NEVER comfortable or relaxing at ANY age. So it's not entirely their faults.</p><p>But still. Don't tell me how the monkey's lifeless skinny arms and empty fur covered head and motionless denture filled mouth are anything like my defiant, squirming, highly alive, highly animated, obscenely strong one and half year old.</p><p>In another scenario we were at a tour for my oldest's new junior kindergarten school. The principal did his spiel, fielded some questions. One of them asked if kids would be able to meet their their teachers prior to starting. No they can't, he says. Then goes on to condescendingly say that come start day, it's the parents that \"need the tissues\". The kids are \"ready to go\".</p><p>Uh, sorry sir. That won't work. My kid will have a hard time. Transitions are not easy for any kid. Much less one that doesn't like them. From breastfeeding and breastfeeding consultants, to sleep and sleep consultants, social media behaviour strategies, the things people say should work don't.</p>",
      "imageUrl": "https://source.unsplash.com/1200x600?teeth,baby",
      "published": "false"
    },
    {
      "body": "<p>It's almost comical the nearly global belief that kids fall asleep in cars. I'm here to tell you they don't.</p><p>My oldest, bless him, singlehandedly broke this beloved belief. He is a case study. He’s now in baby psychology textbooks as an emerging trend. He’s defined a new niche of parent PTSD treatment. He’s a full page in car seat company design handbooks titled “Even 800$ seats don’t always work”. Kidding. But not really.&nbsp;</p><p>My beautiful son fell asleep ONCE in the car. If that. Ever. <em>Once</em>. In almost four years. He was an infant when it happened. And it was probably an anomaly. The result of a poor night’s sleep. Maybe a touch of sickness. Something that made him overtired or another confluence of planets and unlikely events that somehow manifested as a single node of child sleep in our galaxy. Since then, he has not slept in the car. Not once. Not a tiny nod-off. Not a little micro snooze. Not even an eyes half closed inkling of fatigue. Not once. In almost four years. Not kidding. Though to be fair I can’t totally remember. You know, because of the memory loss. All he does, the closest he comes, the nearest planetary system to sleep he comes within range of, is acting a little more quiet than usual. He'll gaze out the window. He'll suck his thumb. He won't mention <em>every</em> construction vehicle he sees. He won't ask as many Whys. That's it. Don't get me wrong. I'll take quiet. Any day. Even <em>sort of</em> quiet. Even more quiet than usual. But don't mistake this for PEACE and quiet. And be sure to not mistake it for sleep. In nearly 4 years to this writing.</p><p>The car made him furious. And miserable. And sad. What kind of kid doesn't like the car? Every single person I’ve ever talked to about it asked me this same question. “What? All kids <em>love</em> the car.”&nbsp;</p><p>“No, Brian, they fucking don’t all love the car.”<br>“Really? Have you tried putting on soft music?”<br>“Fuck you Brian.&nbsp;</p><p>Maybe the car made him stressed. Maybe it made him scared. Maybe he didn’t like the noise. Maybe he didn’t like the motion. Whatever it was, he would <em>wail</em> as soon as the car started moving. Wail. Not cry. Not quietly whimper. Wail. Wail like wild screaming banshee wailing. Some days we'd get him into his seat ok, with not too too much resistance, and I’d think “Hey, maybe today is the day!” But it wasn't. It wasn't ever the day. The only difference from car ride to car ride would be exactly at which point he would start to wail for the entire...duration...of the car ride. Entire. <em>Duration</em>. Long. Or short. Until we pulled back into the driveway. Would it be right away? Would it be at the first stop sign? Would it be two streets away? We once made it to a streetlight 3 blocks away without incident. My wife and I looked at each other. Slowly. Like in a commercial. Our silent eyes said “What? Wait. What’s happening? No noise? Could…I mean…come on…like could it…no, come on, don’t jinx it…like, could this be the…” WAIIIIIIIIIIILLLLLLLLLLLLLLLL.</p><p>Fuck. That was the best we got.</p><p>And it was like this every drive. Every one. Going anywhere. For anything. To get groceries. Aimless Covid driving. Getting a coffee. Getting take out. Getting drive through. Doing to Doctor appointments. Trying to kill time. It was constant. We had an expensive car seat. We got the add-on microgel insert that \"cooled and added comfort\". I tried different angles for the back tilt. Maybe that was it? Maybe the straps were too tight. Maybe he was too hot? No solution or effort made any difference. And there was (I haven’t checked to see if this has changed) very little to almost nothing of value on the vast internet that was remotely helpful.&nbsp;</p><p>There were some articles about it. The intro would sound legit. I’d feel a tick of hope. Someone else has had this problem. It might be okay. “Babies you see, they don’t like facing backward. They like being able to see their parents. And they don’t like it when they’re not being held.” Well, yep, okay, sure, some of that seems to make sense. But enough to induce wailing? Constant wailing? Incessant, everyday wailing? But it got quickly worse as I read on to the suggestions: a) make sure the car seat is comfortable, b) make sure they aren’t too hot or cold, c) play soothing music, d) get a mirror that allows them to see you, e) have you tried toys?, f) bring the seat inside and use it as a chair so they get used to it, and g) if your kid has gas or reflux, make sure car rides aren’t too long so they don’t get extra fussy. To which I can confidently say, is a list of rookie, amateur night, junior varsity <em>bullshit</em>. These are first timer google results. These are people with no kids google results. These are points written by a twenty-something who has no kids. These are points written by a content writer hired to churn out posts for parent blogs. These are points written by a content writer hired to churn out posts for parent blogs that have not researched the topic to see what bullshit google results already exist. They are completely lacking in remotely realistic options for anyone who’s a) tried all of the above (and more), and b) had a very, very hard time.</p><p>The ONLY thing that worked in any measure for us was if I held his hand while I drove. Or if my wife sat in the backseat next to him. My arm would go numb holding his hand. The angle, the duration, it was partly cute, partly painful. And when I took it back to prevent losing all feeling and risking dislocation, he would instantly wail. Again. I wouldn’t even have enough time to let the pins and needles subside. I’d have to throw it back there to keep him quiet. But even still, it didn’t work enough or consistently enough to be a viable solution. Sometimes he’d push it away. Others it just didn’t do anything and the wailing would continue.</p><p>When he was 3 we got him a forward facing seat. It’s been the biggest, most immediate and impactful improvement we’ve seen. Which is saying something. He’ll still complain and moan and whine and scream and cry and resist going into the car and hit his brother and do the opposite of what we ask while looking at us in the eyes as he does it, over and over, but it’s better. It’s better in that it isn’t indiscriminate and relentless wailing. It might be discriminate and periodic wailing. But not indiscriminate. There’s a big difference. But that’s still 3 years of wailing in the car.</p><p>This might not be your experience. I sincerely hope it isn’t and won’t be. But if it is, I’ve been there. I might be the only other one. Brian thinks so. And sadly, if the google results don’t help by then (they won’t), I don’t have a lot for you save for take some time to stretch your shoulder out, and get a forward facing seat as soon as fucking possible.</p>",
      "title": "The Car",
      "imageUrl": "https://source.unsplash.com/1200x600?car,road",
      "slug": "the-car",
      "published": "true",
      "date": "Tuesday May 16, 2023",
      "tags": [
        {
          "category": "The Car"
        }
      ],
      "categories": {
        "cat1": "The Car"
      }
    },
    {
      "body": "<p>Imagine starting your day to screaming. And crying. Intense screaming and crying. At 1:30am. That lasts two and a half hours. And also at 5am (and at other various times, and more than once each morning). Every day. For a year and a half. <em>Every</em> day. But in actual fact, it’s 3 years collectively. Because my oldest kid did the same thing. So imagine starting your day to screaming. And crying. Intense screaming and crying. At 1:30am. That lasts two and a half hours. And also at 5am (and at various times, and more than once each morning). Every day. For three years. <em>Every</em> day.</p><p>Not kidding.</p><p>I woke up this morning, to my youngest son screaming and crying, at 1:30am. He cried and screamed for two and a half hours. I had to go downstairs and eat cereal for a mental break. He’s one and a half. To be fair he’s sick and probably feels like shit. But he still wakes up most nights. It might be long. It might be short. But he wakes up. Which means we wake up. And every wake up means (at least) 30 minutes of wondering if he’ll wake up again before we can relax our brains. Which we often can't. Our latest sleep consultant (more on that later) advised us to keep him in his crib/room until 6am, hell or high water. Which is somehow supposed to make him wake up later? But he still gets up between 5 and 5:30. So we have to sit there while he progressively cries and screams until 6 apparently. Why can’t a child wake up happy? Wake up singing? Or just wake up—like wake up and just be like, Hey, okay, I’m awake. I wanna go downstairs and watch TV.&nbsp;</p><p>I can say with gratitude that my oldest now more or less does this. He gets up, and is just awake. More or less. <em>Finally</em>. At three and a half. It’s great. We’ve come to expect and rely on it. But it was not that way. Not for a long time.</p><p>One thing (among many) that you can absolutely expect, absolutely know for sure, is that you will never be so tired. You have never been so tired. You will not ever be so tired. You will not get a break from being tired. You might never, ever recover or feel “rested” again. I don't know why I put \"rested\" in quotes. Maybe to show how it's not a real thing to me anymore. I used to be \"rested\". I used to know what \"rested\" meant. I used to know what \"rested\" felt like. Now I don't. I don't know if I'll ever be \"rested\" again. Ever. You will experience multiple, back to back nights, weeks, months (and in our case, years) where you get so little sleep you can’t believe people actually have kids. You will wonder how as a species we go on.</p><p>Arctic Fox babies get 3 months. Then they’re pushed out on their own. In the winter. In the Arctic. The Mother literally says fuck off, go fend for yourself. Snow Geese push their young off 200 foot cliffs and hope a couple three out of five make it down without dying. Those that do have to walk it off and go find food. Humans are a bit smarter. And can do cooler stuff. But fuck, those animals have nailed the child rearing situation down better than we have. By far.</p><p>In movies and commercials you see parents with funny dishevelled hair, bags under their eyes, a hunch-slouch posture, shuffling around the house like zombies. Those parts, are all true. But like the memes, in real life it's not funny. It's real. Combine this visual comedy with the reality of no sleep. Movies and commercials can’t successfully convey how it <em>feels</em> to not sleep. For <em>months</em>. For years. The kind of no sleep you can’t even convey or explain. You become a shell of a human. Life becomes about getting through the day.</p><p>There’s a laundry commercial: a rested, showered, light-in-their-eyes couple sit together and fold laundry by a window. They talk about how hard it is to keep things clean with their 3 young kids. Who as it happens are absent from the scene. Which as it happens, never happens. Maybe they’re in daycare or school or with the nanny. But no one with three kids— no one that actually looks after and is present in the lives of 3 kids—is rested. Even if they have a full time nanny. In which case, they wouldn’t do their own laundry now would they.</p><p>In another version, an “exhausted” couple stand in an ominous, darkly lit laundry room. Dad has the baby. It’s in a carrier. It’s quiet. It’s not crying. It’s not screaming. It seems rested. <em>One, single</em> baby. Not two. Not a baby and toddler. Not twins. Not three. Their eyes are half open with massive bags. They’re hunched. They look at their shitty competitor laundry detergent. Then look at each other. Mouths hanging open. And the narrator says “Name-Brand (whatever bullshit) ultra clean…works hard so you don’t have to”. And suddenly the couple comes alive. Light enters the room. Hope fills the scene. They’re miraculously rested. And they <em>dance</em>.&nbsp;</p><p>In reality this doesn’t happen. Only the first part. Only the darkness. The eyes. The bags. The slouch. The shuffle. The almost-dead-ness. Oh and the laundry doesn’t get done. Regardless of detergent brand.</p><p>Think too that it's not like when you were single. Or even in a relationship <em>without</em> kids. If you're tired, hungover, or sick, you can take a day and lie on the couch. You can lie on the couch and do nothing. No one bothers you. You have no one who's life might hang in the balance if you close your eyes. You only have to feed yourself. You can sleep whenever you want. For as long as you want.</p><p>This is not the case with kids. Picture the pure fatigue and/or sickness and/or hangover mentioned above, but then add one or two or more young kids that need feeding, cleaning, entertaining, protecting, driving, playing, laundry, and attention. There is no stopping. There is no resting. There is no break. There is no couch.</p><p>Of course there is the option of getting a babysitter or nanny. But cost is a factor. Grandparents can help too but there are time, energy, strength, age, and annoyance issues. And in most cases alternate caregivers come at night, or on weekends, for a few hours. And real parenting needs the <em>actual</em> parents. Surrogates who help raise kids are great for giving parents a break. But kids need their actual parents to be the ones who are there, all the time. Of course different parents do this part differently. In which case, maybe you DO get sleep. In which case maybe you want to just stop here and go lie on the couch. More power to you motherfucker.</p><p>The fatigue (that WE feel) is so deep that naps don't touch it. Rare \"good\" nights of sleep (i.e. from 9:30 or 10pm to 4 or 5am) don't really dent it unless there are a few repeat good nights back to back. Which doesn’t really (ever) happen.</p><p>Currently my oldest naps from noon to 3:30pm, sometimes 4. But he’ll soon drop this nap and start staying up all day. My youngest still has two naps, morning and afternoon, and is on his way to one nap. Which means at the moment, this gives us as parents <em>one</em> hour of overlap where both kids are asleep (on weekends). An hour. Of course my oldest is normally in daycare, but over the holidays and when he's sick (which is often) and over Covid (which is forever) we keep him home. Which means we’ll soon get no hours. No break.&nbsp;</p><p>Yesterday, my youngest didn't nap in the morning. My oldest didn't nap at all. And so, our glorious ONE hour of normal break didn't happen. I know, it sounds idiotic and unimportant. But it ruined us.</p><p>And so it goes. Fatigue becomes ever present in the life of a parent. I think one of the only useful pieces of reality I heard from a parent somewhere about kid-related fatigue is that you just “get used to it”. Which is only sort of true. You don’t get used to it the way you get used to a dip in a couch. This implies it becomes “fine” and you go on about your business. You can avoid a dip. Sit somewhere else. The only way you get used to ever-present fatigue is by realizing it’s an unavoidable part of your day to day existence. Possibly forever. You also get too tired to really care or try to do anything about it. It just is. It’s just there. And there’s also the coffee.</p><p>Occasionally you get a moment or two where you feel kind of, almost, sort of like your old self. Kind of. There’s a glimmer of what it was like to have thoughts. To feel even an inkling of creativity. Or possibility. But it’s rare. And fleeting. Every year and stage of child development has its list of challenges and changes, which means, at least from what I’ve heard, the fatigue thing eventually fades. I can’t say yet whether that’s true. Better in my opinion to just accept that your life will be an exhaustion-ridden existence for the foreseeable future than to hope it will change. Dark but effective and realistic advice.</p>",
      "title": "Fatigue",
      "imageUrl": "https://source.unsplash.com/1200x600?bed",
      "slug": "fatigue",
      "published": "true",
      "date": "Tuesday May 9, 2023"
    },
    {
      "body": "<p>I studied the super aggressive, highly brutal, military derived, and totally awesome Israeli martial art of Krav Maga for a little over 3 years. I still consider myself a practitioner and try to train when I can and hold onto the mindset. While there are myriad clubs and different streams and a thousand videos with guys in camo, you don't see a lot of the <em>genuine</em> art online unless you sniff it out. The legit organizations are more secretive and don't post bullshit about how many asses they kicked using this knee to that groin. It’s an art that combines the most effective self defence techniques from a variety of arts (striking, grappling, weapons) with a goal of simplicity and ease of learning. Classes aren’t full of movie stances, animal postures, chi extension, or crane kicks (I loved Karate Kid). They aim to recreate live situations: i.e. defending yourself from someone actually attacking you. Which means flashing lights, surprise attacks, blindfolds, blaring music, yelling, screaming, choking, gouging, and actual fighting. They build into you a mindset of aggressiveness, instinctive reaction, and self preservation. They are destructive and <em>amazing</em>. And then there are the tests. Krav belt tests run into the 5+ hour mark -- longer for the higher levels. Fitness, techniques, sparring, self defence -- it's the most gruelling and physically taxing thing I'd ever done.</p><p>Until having kids.</p><p>One of my teachers whose fame will live on eternal as the drill sergeant instructor would talk about building your mental and physical toughness to a point where you can't be broken. “You can’t break me” he’d routinely say. And I still believe it. If you water boarded him he’d find a way to make you cry before somehow finding a way to kick you in the balls even as he died, while laughing, calling you a little bitch with his last breath. Krav is about not giving up. Even if you're tired, weak, out of shape, hungover, beat up, have shitty technique, or just suck—you do your best. You keep going. You don't stop. You fight. Tooth and nail.&nbsp; Until you're safe, your attacker is disabled, or the class is over. Before kids, I would have said I’m relatively tough. I can hold my own. I was a respected member of my club. And for a while felt like I was on track to become an instructor. When people said how brutal Krav is, I’d always say “Ya it is. It fucking rules\".</p><p>But after two belt tests and 3 years of weekly practice, I can with total confidence and authority say that <em>a baby</em> - not Krav Maga - thoroughly and completely broke me. Incessant crying. Incessant whining. Incessant, repeated, cyclical, constant sickness. Incessant sleeplessness. For <em>years</em>. Not days. Not weeks. Not months. But <em>years</em>. Has broken me. It has deeply affected me, deeply drained and crushed me.&nbsp;</p><p>I mean, I’m still, as I write this, actively alive. And I’m still going. I’m still a parent. I still love my kids. And I guess I still haven’t fully given up. So that's something. But I've cried. A lot. I've aged. A lot. I've hit my limit. A lot. Multiple times. I still hit it. Often. Like this morning. And I've given up. A lot. I had never said “shoot me” and “just kill me, please” in my life up to this point. And I’d certainly never said it <em>repeatedly</em>. A younger, pre-kids me would have been horrified that I’ve said it so much. I never said it in Krav. Not once. Not in a single class. Not in a test. I never felt it. Never felt broken the same way. And while Krav is tough, I would do a class, a belt test, or fight someone - any day of the week - and find it easier than being a parent. Krav is EASY next to having kids. In fact I suggest any bourgeoning parent go study Krav Maga, for a year, at minimum, before having kids.</p><p>Then decide.</p><p>Because you see, classes end. Tests end. Fights end. They might not be pretty. You might get beat up. You might get bruised and broken and shamed and hurt. Even go to the hospital (though not likely, I mean they’re not complete animals). But a broken rib, black eye, concussion, or limp is literally NOTHING compared to a constantly difficult child (much less two, or three, or twins). With a broken rib and no kids, you can sleep. With a broken rib and no kids, you can lie on the couch and rest. With a broken rib and no kids, you can order take-out and watch movies. With a broken rib and no kids, you can sleep. Did I say that one already. Well, fucking read it again. A broken rib heals. It takes months but it gets better. It stops. Kids. Do. Not. Fucking. Stop. Fatigue and sleeplessness do not stop. Crying and whining and tantrums and hating the car do not stop. To be fair, things can, yes, change. But it isn’t fast. And it isn’t complete. They just slowly, slowly change. And usually that change comes with a slew of new problems. Not some “finally, we made it” sunny beach with margueritas and palms trees type ending.</p><p>My oldest for example got to the 3 year old mark and was able to sit in a forward-facing car seat.&nbsp; It was as life changing as anything we’ve so far experienced. He was excited. He could look out. He could see. His whole life experience changed. But it didn’t mean he started just loving the car, or not crying, or not getting super exhausted and screaming after daycare all the way home. It just got <em>better. </em>He still screams and cries and stomps and refuses to go in and refuses to come out and kicks and hits his brother next to him. It’s just an <em>ounce</em> better. That’s the kind of incremental change I’m talking about.</p>",
      "title": "Kids vs. Krav Maga",
      "imageUrl": "https://source.unsplash.com/1200x600?black,minimal",
      "slug": "kids-vs-krav-mage",
      "published": "true",
      "date": "Monday May 8, 2023",
      "tags": [
        {},
        {
          "category": "Krav Maga"
        }
      ]
    },
    {
      "body": "<p>When you have kids you enter this alternate world. It's a bit like war. Only vets actually <em>know</em>. Okay so ya that's a bit extreme. And way too soon. It's not <em>quite</em> the same. I mean at least war <em>ends</em> right (at some point)? The buildings can be rebuilt. Economies come back. Kids are for-fucking-<em>ever</em> man. Okay, so ya, still, not quite the same. I mean it's kind of the same. But less violent. Sometimes.</p><p>Still, in this kid world, you start seeing and resonating with piles of Instagram “wine time” memes, diaper blow out jokes (which you don’t ever hear about the way you really, really should—not the way they really, really happen), snippets about tantrums, potty training, jokes about teenagers, pot, and you'll for the life of you hear more than you ever wanted to, that \"They grow up so fast\". But it's rarely real. Like you don't actually get into <em>why</em> the Mommy needs wine meme is a meme. And for some reason it always has to be funny. I mean everything’s better if it’s funny. Especially the hard shit. Even more so with kid shit. And actual shit. But the <em>funny</em> belies the <em>reality</em>. Like instagram. And aside from the funny, no one gets that deeply into why that little 3 second tiktok is a complete and totally accurate summation of existence. To the point where you just laugh and nod and say, “Yep, that’s it”. Then cry.</p><p>Enter a Mom on loop chugging a <em>gigantic</em> glass of wine. A glass so big it could only have been custom made. Something from one of those one-off knick-knack shops. A glass with so much room that “I could really use a gigantic glass of wine right now” fits etched on the side. It was likely gifted by another Mom. Yes it’s funny. Yes it’s real. Yes it’s a complete and totally accurate summation of her existence. And my existence. And every other parent’s.</p><p>But she’s not drinking it because it’s funny. Or because she’s trying to be funny. She NEEDS it. She HAS to have it. It returns some sense of sanity. It’s a break. It helps her forget. And in the meme you don’t see she’s covered in shit. And spit up. She stinks. She hasn’t showered in days.&nbsp; She hasn’t changed her clothes in days. Because she has no clothes. They’re either dirty, or don’t fit her anymore, or aren’t in style anymore, or are maternity wear which doesn’t fit but she continues to wear because nothing is clean. She hasn’t left the house in days. Two piles of laundry are sitting at her feet. Just out of the shot. And there’s another that’s even more annoying because it’s clean and has to be put away. Any makeup she’s wearing is accidental. Or maybe also just shit. And she still has a bunch of stuff to do before going to bed after said wine. Where she likely won’t sleep. Where she likely will be woken up, multiple times. At which point she’ll do it all over again, and wait, all day, for that meme again. Which means, in reality, she has a drinking problem.</p><h3><strong>Beer time</strong></h3><p>Now picture that same Mom meme. But with a beer. A gigantic glass of beer. And a Dad. It’s the SAME. Maybe not <em>entirely</em> given the fact that while Mom and Dad equity is vastly improved and increasing, job sharing isn't likely yet a 50-50 split on average. But it’s close. Or getting closer. And it doesn't necessarily matter if roles are evenly split. The <em>need</em> for Mommy wine and Daddy beer time is real, for both parents. It's a balm. It's a crutch. It helps the day slide off a little easier after the kids are in bed. But since it’s more normalized (i.e. totally expected and supported by eons of movies and books and pop culture and actual examples) that guys will wear the same underwear (and anything) for X days in a row, not shower, not do laundry, not clean, and chug a glass of beer/wine at most any time of day, it comes off in a less tragic and more “Haha, typical dude” kind of way. But it isn’t. It’s just the same kind of essential medicine.</p><p>With my first child, it was pandemic. The curtain had just fallen. The world went dark. He was about 8 months old. Everyone was scrambling to figure it out. All the in-person service businesses were shuttered and fucked. It took less than a month for the breweries and wineries to offer delivery. Halle-fuckin-lluia. Why was this the first time anyone thought of beer delivery? Within a week I had my first order. It showed up on my doorstep within 24hrs. Two 2-4s and a 6-pack. I took pictures. I got a text notification. It was so exciting. It was a whole new world. I’d actually never been the type to buy 2-4s. It’s too much at once. And expensive. A 6, an 8, a 12. Then come back for more. But this was another level. It was a new time. Why not stock up? I can’t just go back to the brewery. Wait, I CAN’T go anywhere. It was a different life. A new way of thinking. It hadn’t happened before. Everyone was trying to sort it out at once. Stay at home? What? All day? Every day? And do what? Back to the 2-4s. I mean the TWO 2-4s. And a 6 pack. Enter a global drinking problem.&nbsp;</p><p>But if I back up a bit, it was this way, albeit a little more responsible, prior to Covid. Alcohol was already a big part of our lives. Beers after work, beers on weekends, craft brewery taprooms, flights, wine, and of course, drinks in the evenings. The pandemic surely gave us more time to drink, but it’s fair to say it amplified an existing situation. What did change our drinking for the heavier was having a newborn. Enter the wine/beer time. The whole no sleep, difficulty feeding, waking up at all hours thing doesn’t lend well to not drinking. We were high on having our first kid, in our first house, and delirious on adrenaline and zero sleep. Alcohol made almost everything better (mornings being the glaring exception). Once ‘demic arrived, the combo of difficult infant and being homebound because of a frightening global virus brought the drinking to a new level altogether. Enter the 2-4s yet again. 2-3 beers a night became more or less the baseline. It was fun. It was freeing. It was festive. Everyone was doing it. And Christ did we ever need the medicine. Alcohol gave us the escape we needed. A slice of humanity (I refuse to say “normalcy” for all the abuse and overuse that term got over 3-4 years of people complaining about not being able to see other people). A sliver of hope. A glow of possibility.</p><p>But the facts remained the same. We’d wake up, slightly hung, to all the same realities. Screaming kid. No sleep. Difficulty feeding. Stress. Fatigue. Laundry. Mess. Round and round. With our second kid, I dove headlong into teetotalling. I’d had enough of the hangovers. A small backstory snippet is that I always and forever got unfairly hungover. Sometimes from 1 drink, often from 2, always from more than two. It sucked. It was also not cool to be drinking while my pregnant wife sat next to me. The combo of the two gave way to picking up all the non-alcoholic beer options on the market. There are some good ones. And they’re increasing because Moms and Dads that love craft beer can’t drink anymore because of their f*#$ing kids.</p><p>The occasional person and maybe one or two of the parenting books will give you a tiny inkling of the reality behind the diaper. But nowhere, in my experience, do you get a low down, dirty, real-life, play by play assessment from real parents—especially those who don't have nannies or grandparents or babysitters or others that do most of the actual parenting—or those who have kids that are so easy they raise themselves. Or from real parents, parenting real, difficult kids.</p><p>Before our first child, we tried to do what every new parent does. We bought all the books, talked to friends, read articles, did the prenatal course. I could tell you the best positions to relieve labour pain and encourage contractions with my eyes closed. Olive oil on the perineum is a thing. Dried fruit, coconut water, nuts: good for the long labour haul. But fuck if it did anything to actually prepare us for what happens after the kid comes out. Or for that matter if you get an epidural. None of that Doula shit is necessary when you’ve got the glory of high level, spinal tapped pain meds. Which means 60-80% of that prenatal course was unnecessary. Don’t bring scents. Don’t bring dried fruit. Don’t prepare motivational phrases. Don’t make a playlist. Don’t suggest zen breathing when she’s bearing down. Just don’t.</p><p>I had friends say \"lean in\", change as many diapers as you can as the Dad, and our perennial favourite: \"it gets better\". I never used the phrase \"shoot me\" before, much less once every other day.</p><p>Kids are miracles. For real. No joke. My wife and I on both sides have friends who either couldn't have kids, or were too old and not in relationships or for other reasons weren't able. We are thankful every day. But they are in equal part, if not more so, difficult, frustrating, incredibly challenging, soul questioning little maniacs. They push you, sometimes as part of growing, sometimes on fucking purpose, to the point where your body will not take another adrenaline spike or more sleeplessness. Where your mind will literally break in half if you have one more night of coughing. Kids are hands down the most gruelling, the most demanding, the most rigorous, bruising, visceral, crushing, and also rewarding thing I’ve done in my adult life. \"Rewarding\" comes in at a lower ratio compared to the other items on the list, which is why it's last. But it's there. It <em>is</em> there. There's something about getting through a day. Or five years of days. And while I’m no hero or professional <em>anything</em>, I’ve done a few things that were hard that couldn’t hold a candle to having kids.</p><p>This blog is my attempt at conveying some of the realities of our lives with two kids up to the age of almost four and one and a half. I hope it ends up being the kind of thing that would have helped <em>me</em> before having my first kid. I hope it might be the only “baby blog” you’ll need, despite not really giving you any useful information, just a constant stream of difficult anecdotes and real life incidents that have made me want to cry more than ever before in my life. I hope it’s the type of resource that gives parents-to-be a real, yet funny and hopeful (underneath all the dread and fuuuuuck man Jesus Christ almighty stop fucking screaming please fuck, God help me) outlook on parenting.</p>",
      "title": "Wine Time",
      "imageUrl": "https://source.unsplash.com/1200x600?grapes,red,abstract",
      "slug": "wine-time",
      "published": "true",
      "date": "Friday May 4, 2023"
    },
    {
      "body": "<p>It’s the hardest time.</p><p>Almost four years ago my wife and I had our first kid. A boy. He's beautiful and amazing and phenomenal. A year and a half ago we had a second son. He too is a miracle and an incredibly joyful addition to our lives. We are grateful, thankful, and better off for having kids.</p><p>Taken together, they're a fucking massive amount of work. And very often they’re an enormous, incalculable, anxiety-inducing, blood-pressure raising pain in the ass. We also managed to get a very, VERY difficult first child, and a second that has slept more or less like balls for a year and a half, which has made the past collectively 5.5 years (and now, and now, and also right now) a sleepless, stress-ridden, early age-inducing debacle.</p><p>After loss of sleep, stress, depression, anxiety, anger, sadness, and almost every other human emotion (including joy, yes), I wanted to document our experience not only for our (lacking and worsening) memory, but in the hopes it might—in contrast to most baby books on the market— <em>actually</em> be mildly useful to new parents or people thinking about being parents or people who wished they were parents with some dream of what it’s like but really have no fucking clue what it actually entails.</p><p>I'll reiterate that the madness that ensues (here and in every post, thought, moment, etc) encapsulates the toddler and infant era--at least in my family. I don't know yet about what comes next. Things might get better tomorrow. They might stay the same. My youngest still has to go through the hellish nightmare of a toddler year we're still in with my oldest. So there's that. And friends with slightly older kids don't seem to complain that much. So they're either lying (which is pretty much the bar), or it does actually improve. On paper I can say I'm confident EVENTUALLY things will improve. In how long? At what age(s)? I don't know. But these past years have been a trial. A test. They're not all goo goo ga ga. Get ready.</p><h3><strong>Good marketing</strong></h3><p>Parenting is not what they tell you in books. There may be no bigger marketing success than the parenting media segment. This most genuinely vulnerable and needy swath of people - new parents (in particular Mothers) - has the largest amount of utter bullshit fed to it from all sides of the media and e-commerce spectrum: books, blogs, products, foods, clothes, furniture, toys, classes, courses, social media groups—it’s all just sunshine and moonbeams and my dearest baby boy this, my darling girl that. The range of books on babies and becoming a parent is <em>staggering</em>. There are the medical ones, there are the philosophical ones, there are the picture ones, there are the what-the-Europeans-do ones, what the hippies do ones, the ones about music and the womb, books from hospitals, books from Moms, books from Dads, books from psychiatrists, from sleep consultants, from non-parents, etc., etc., etc. Not to mention books on feeding, on behaviour, on how to make them geniuses. And then there’s the parenting books for <em>parents</em> like financial planning for single moms, rich parent poor parent, and a host of others.</p><p>While I haven’t come close to reading them all, and while I’m also sure <em>some</em> are useful (if you have time to, you know, sink into an entire book while pregnant and/or working in the hopes that it’ll be the ONE book that does something for you, and you actually, you know, remember anything it says in a, you know, actual, practical moment of need), most of the books fall short. In many to most cases, the books are not in fact useful. They can actually be counter productive. You invest precious time into reading them, assuming, expecting, hoping you’re internalizing some useful information. Information you’ll, you know, <em>use</em> when your baby comes out. And if you’re like us, you bought a LOT of books. So many books there’s no way any human would have the time to read them (unless we started in advance of being pregnant). And because there were so many, we couldn’t even really know which one to focus on. Some have tidbits of useable stuff. But where we did find use, with ALL of them, was as a coaster. Or placemat. Or TV remote holder. Or paper weight. Or decoration on shelves. Perhaps THE most useful application of baby books is when kids are sick: if you stack them up together, they’re great for propping up a crib at one end when your kid has a cold or runny nose.</p><p>But when you have a real kid problem, the books don’t do much. Especially if it’s a problem you’ve tried some stuff for. I could not find more than a single worthwhile article, not to mention book (after days of internet searching) for example on what to do if your kid hates the car. And I don’t mean just the standard “my kid hates the car” my kid hates the car. I mean really, really, <em>really, </em>like can’t even <em>go</em> in the car type my kid hates the car.&nbsp; And I don't mean the useless posts (most likely ghost written by millennials in their one-bedroom condos) talking about seat strap tightness and “have you tried car toys and singing songs together?” I mean like when your child wails—screams—<em>non-stop</em> for the duration of <em>every</em> car ride. Every care ride. Seriously. As soon as the car goes into drive. And until it comes back into park (which for us often literally meant pulling out of the driveway, and pulling right back in).</p><p>As a parent now for 4 collective years, I can say honestly that I have never been so tired. I have aged greatly in a short time. I have not slept well since our first child. I have higher blood pressure than I ever did before. I get emotionally broken and overwhelmed easily. I don't see friends (though often of my own doing, but usually based on fatigue and opportunity-cost i.e. sleep vs. putting on pants). I don't really care to make plans aside from getting out of town with my family when possible. I don't care to do much aside from try to recoup mild amounts of energy between child-related events. General inspiration is low. We look forward most to the two or so hours of the evening after our children are in bed. At which point we mostly stare at the TV with mouths agape. And larger life goals and motivations are not really possible to think about given points A through J.</p><p>But this ladies and gentlemen, is what it means to have kids.</p><p>No one really tells you what it's like. Comedians try. Books try. Movies try. But not anyone who actually knows. Or no one who actually knows and is <em>willing to tell you the truth</em>. And when I say no one, I mean like people who <em>actually have kids</em>. I mean like even your friends who have kids. They just <em>don’t tell you</em>. In part because they’re too tired. In part because they can’t remember what happened yesterday much less a month ago. In part because they don’t want to talk about it. In part because it uses up too much precious player-health-energy to get into the details when those details are the only thing they live, day in, day out. In part because talking about the realities would take so long and make them out to be so depressed and depressing that no one would want to stay to hear it. And in part because they don’t want anyone to know they had (or are actively having) a difficult time and want it to sound like everything is awesome. If people who have kids and know what it’s like actually tell you anything, it’s funny fun stuff. Or funny fun hard stuff. Or funny fun shitty stuff. But always funny. And fun. It has to be a bit. A “story”. Something to talk about with strangers. Another 2 minutes to add to your tight five. Oh my kid’s throwing another lying down screaming crying screaming kicking screaming shitting screaming hitting screaming tantrum: haha, how funny. Those <em>kids</em>.</p><h3><strong>The backyard BBQ</strong></h3><p>Case in point. I was at a backyard bbq the other day. All the families from the street came.&nbsp;So like 7 families. But still. All but one couple had two kids. So that’s 6 x 2 + 1. 13 kids. Now you’d think this would be the place where parents talked about their hardships. If there’s a place to let loose, to let your emotional hair down, to talk to other parents about parenting, it’s a goddamn bbq. The behaviour, the sleep, the sickness, the feeding, the fatigue, the cost, the memory loss, the weight loss, the depression. The din should have been heard three blocks over. But it wasn’t. We should have talked about common experience. But we didn’t. People should have confided in one another, shared stories, supported one another. But it wasn’t. Most of us were actually chasing our kids around. So there’s that.</p><p>The closest it came for me was when a Mom I didn’t know asked what time my youngest goes to bed. As he was approaching full fission reaction around my ankles after a full day at daycare in the hot sun with likely his first sunburn of the season and wild with hunger and fatigue, I said, “now”. Which was almost 6pm. I followed up saying, we start the routine around now, which ends up usually being 30mins to an hour. There was the empathetic nodding and eye rolling and hunched shoulders and sighs and “I’ve been there”’s and “Yaaaa”s. But she didn’t respond so much as just mutter something that sounded a lot like: “Ahhh ya, we don’t talk about that”. Like, it’s too painful to talk about. Or <em>let’s not go there</em>.&nbsp;</p><p>Which seemed funny but oddly appropriate. I didn’t need to get into the difficulty of it with her. It wouldn’t help me in that moment to have someone I didn’t know empathizing. And much as she might want to know more, she doesn’t need to hear yet another stress story of putting kids down for bed. Parents do it every motherfucking night. Do I need to hear YOUR particular issues with it? On TOP of mine?&nbsp;Likewise does it really help <em>me</em> to vent my private toil to someone who’s name I still don’t actually know? Will I feel supported? Will her sympathetic, angle-headed nodding give me the peace and rest I need? Nope.</p><p>But there’s the rub. The people with intimate, hard-won knowledge of one of the most difficult activities in the pantheon of human experience—the best test group for data collection, the most ideal gathering of same experienced people in one place—don’t want to talk about it. Like, “It’s a bbq. Let’s just sip our fucking bubly, chase after our kids playing on this totally not-to-code play structure and eat these Costco burgers, ok?”.</p><p>And that’s where it hit me, you know, <em>again</em>, or maybe just more brutally: the super difficult experience I’ve had for the past 4 years is almost guaranteed to be shared in some way, by at least one other parent in whose company I was then standing. Could I confide in them? Fuck no, I just met them for Chrissakes. You can’t just jump straight into your problems. Even if you both have kids. You don’t know each other. Sharing kid stuff is kind of universal with people you don’t know, but only to a degree. Again, like just the funny stuff.&nbsp; Or the funny brutal stuff. Or the funny not sleeping stuff. Like “how funny, <em>those kids</em>”.</p><p>And that’s pretty much the chestnut of it. Why no one talks about their experience parenting…with <em>other parents</em>. Other parents who also have difficulty. Even if their kids are less difficult. It’s still difficult. But no one else who knows it’s difficult, and shares your difficulty, and knows you are having a difficult time, as they are, makes it any less difficult for you, in your difficulty.</p><p>Near the end, I went to talk to the host who was barbecuing. He has two kids. His partner does a lot, which I know from \"neighbourhood visibility”. But still. I thanked him/them profusely. I said man, this is above and beyond. Thank you. He shrugged, “Ah, you know, it’s just a little thing”. I said “No man. It’s NOT a little thing. It’s a big thing. You’re barbecuing burgers, hot dogs, buns, have condiments, multiple salads with shaved nuts, fizzy drinks, melon-balled fruit plates, and questionable homemade cookies. For 10+ people. This is not little. It’s big. I cannot, and do not, want to do this myself”. Of course it’s polite and part of a host’s job to just say \"Hey, you’re welcome” and not get all emotional like I did. But still. Another example of people with multiple kids, doing hard work, not hinting at the underlying challenges.</p>",
      "title": "Sunshine & Moonbeams",
      "imageUrl": "https://source.unsplash.com/1200x600?abstract",
      "slug": "sunshine-and-moonbeams",
      "tags": [
        {
          "category": "marketing"
        },
        {
          "category": "parenting"
        }
      ],
      "published": "true",
      "date": "Tuesday May 3, 2023"
    },
    {
      "body": "<p>There's a lot going on in the world. It's gruesome out there.</p><p>At the time of this writing, Russia’s invasion of Ukraine is nearly into a second year. The Covid pandemic claiming almost 680 million lives is more or less \"over\". But the virus is now endemic, still taking thousands of lives a day in first world countries. Refugees worldwide are increasing at a staggering rate. Climate change and extreme weather (and earthquake) events are on the rise. Authoritarian regimes and far-right politics are gaining and/or holding in support. Violence, racism, inequality, inflation, and cost of living everywhere is high. AI will probably lead to <a href=\"https://en.wikipedia.org/wiki/The_Terminator\" rel=\"noopener noreferrer nofollow\">Skynet</a> in a couple years. It’s a dodgy and difficult world right now. There are a lot of problems. Raising kids, or maybe more specifically, <em>complaining</em> about raising kids—while a big responsibility in terms of bringing up the next generation—ranks pretty low on that list by comparison.&nbsp;</p><p>But.&nbsp;</p><p>Raising kids is still fucking brutal. It's a miracle our species procreates willingly. It's got to be an evolutionary development that sex completely short circuits the brain. Those few minutes (or seconds) are just so good that a lifetime of consequences can be totally ignored. There has to be a missed opportunity in there for the far right Christians. No need to use God or guilt or sin or any kind of coercion to force your kids to abstain before marriage. JUST TELL THEM HOW INSANELY BRUTAL IT IS HAVING KIDS.</p><p>Beyond that I’ve come to believe that parents are nearly invisible for the first 4–5 (or 6, or more) years of their kids’ lives. Like unseen. Unheard. Just living. Or being sick. Doing everything possible to stay ALIVE. We were. We&nbsp;<em>are</em>. And that’s why no one really knows about it. The difficulty. The fatigue. The stress. The<em>&nbsp;</em>fatigue. The memory loss. Sure, you might see some parents once in a while. They might get a dinner date or some quiet time while their kids are at daycare. But even then, as a parent yourself, you won’t see them or hear them or learn anything valuable from them about the utter cave they’re in. The grind. The relentlessness. The whining. The fatigue. The memory loss.&nbsp;<em>Wait</em>.</p><p>Parents, especially new parents, and also seasoned parents, and also grandparents, don't (really) talk about this stuff. For a lot of reasons. Not the least of which is it's just more effort to talk. On top of the day, last night's sleeplessness, and my kid's Norovirus, I have to also talk to you? Opening your mouth, thinking, contriving a sentence. It's hard. It's not like it was back in the day making conversation at bars. The small talk generator is out of service. And don't get me started on the impact to my socialization that is and was the miracle of Covid. I used to be (kind of) funny. Charming. Witty. Able to think on my feet. Now, I talk about my latest glasses prescription. The fact that I need bifocals. I don't want them. But I need them. Cough. I need another coffee. I can barely think of responses to simple, direct questions. Often I just grunt or shake my head and something falls out. It's probably got something to do with the fatigue. And memory loss.</p><p>But still, raising kids is a fucking <em>wondrous</em> miracle. Despite the difficulty. Child rearing (who decided to call it rearing?) is an insane ride that as a new parent, I was totally unprepared for. I don't mean the concept as a whole. It was pretty evident we were having a kid. We bought the stuff. We got the books. We \"understood\" (theoretically) it would be \"hard\". The issue was the details. The day to day. The reality. What it's actually like. It's a bit audacious to say in 2023 that no one's talking about it. There are a jazillion social media parenting accounts. Everyone's trying to make a living off it. But it's all the surface cream layer of the butter, the good stuff, with well lit, white backgrounded, highly produced segments about creams and carriers. But as I'll get into, despite the books, the resources, the videos, the newsletters, and even your friends, people don't really talk about the dark web of what it's like to have a kid (or two). Not the way I wish they had.</p><p>Like when kids are difficult. Really difficult. When you're at your mental and emotional <em>end</em>. Have you arrived at your emotional end before? When one more cough, one more cry, one more 3:45am morning makes you clench, cuss, then cry. When things don't work the way the internet says they should. When you’re not in control. When you don’t know. When there aren’t any answers. When it’s not glamorous. When you’re not living the dream. When you’re not winning. When it's ugly. When it's hard. When it’s dark. When it's cold. When you're asking yourself why you made this life choice. The books and resources I found were not helpful. They were full of facts and foods and trends and tips and likelihoods, all infused with happiness and hope. They didn’t deal with the reality. They didn’t deal with the actual experience. They didn’t delve outside the box of usual parenting, with usual kids, having usual issues, that for the most part, weren’t difficult. They didn't help the way I hoped they would in the first years of my kids' lives. And so, in spite of the madness on planet Earth in 2023, I hope this crazy rant gives someone out there like me a bit of a reality check, a bit of support, a bit of hope, and a bit of a laugh in the face of the difficulties (and utter joys) of raising kids.</p><h3><strong>Dadding</strong></h3><p>I love being a Dad. It’s hard. It’s trying. It’s manic. It’s all the emotions—as I’ll outline in eye rolling, repetitive, bloody detail. But even as a super committed Father, it’s still staggeringly accepted, on average, that Dads have little, if not <em>less</em>, to do with the parenting process. Maybe woke is slower to make its way to Dadding. It’s at minimum accepted that Moms are the ones that still do all the heavy lifting. And to be fair, on average, this is very likely still accurate. But in truth the number of stay at home Dad’s (they really need a better acronym—SAHD is a bit too real) and ones who commit to an equal split of parenting responsibilities, is much bigger than even 10 years ago. Even five years ago. And it’s steadily increasing. Oddly I’ve read the pressures on Mothers to fulfill an idealized role hasn’t abated much with the uptick in Dad-volvement. It’s like modern Mothers (or many) still believe that to be successful and deserve the title, they should be doing everything—despite the assistance of Dads: working AND booking appointments AND making lunches AND responding to emails AND cooking dinner AND cleaning up the house AND doing bedtime routines. But the fact remains that while it may not yet be the norm across a general swath of society, Fathers are more interested, more engaged, more committed, and more willing to be as much a parent as their partners. At least 50% of the parents that drop and pick up their kids at our daycare are Dads. Some, like us, drop the kids together. As a test group, our daycare is predominately white, with some Asian, Brown, and fewer Black families, and the age and financial demographic places us directly in the 30s-40s mid to upper economic spectrum. So while that could be part of the reason we see a more equitable parenting approach, it’s not likely an accurate picture of what it’s like everywhere.</p><h3>Daddy Bear</h3><p>I routinely watch an all-female talk show. Yes it's during the day. Yes the topics and content are blatant, often (always) unfounded fluff and personal opinion. It's usually about stars and social media and metallic pants. But it does occasionally have a good subject. Often they discuss kids and parenting. The other day an episode got into bullying. It was all “Mama bear” this and “No offence to the Dads in the audience, but just back away, the Moms are on it” that. I was like, fuck you. I still want to crush the little shit in my oldest’s daycare class that keeps giving unsolicited, space-violating hugs. In another, in response to a question regarding America and free speech, a host used a divorced couple (with kids) as a metaphor for Canada and the United States. Canada was the responsible Mom; the US, was the deadbeat, pizza for every meal Dad. Without any further explanation I was utterly, jaw droppingly offended. First, who in their right mind (<em>some</em> offense intended) would want to be compared to America? For <em>anything</em>. Maybe only in military spending and concentration of wealth. Second, to have the Mom be, again, presented as the only and perpetual symbol of good, safe, proper, conscionable, responsible, caring parenting — and the Dad, the picture of careless, juvenile, gun-toting, pizza serving incompetence — is shocking for a major <em>Canadian</em> television outlet in 2023.</p><p>And of course it's just a show. And they're probably at least in part right. Maybe more than part. Maybe 50%. Especially given, you know, <em>America</em>. But still. Three of the four hosts don't have kids. The <em>one</em> that does has ONE kid. And In practice these social constructs aren’t true. Dads now are in large part equal parents with their partners. Some have fully flipped the 1950s norm. I know a couple where the Mom makes so much money it’s not worth it for the Dad to work. He stays home with the kids. Bingo bango. From household management, to school drop offs, parenting, research, shopping, etc., Dads now largely participate in 50% of more of the work that would traditionally be assumed by the Mother. For me, I want to be the best, most available, most supportive, most loving, most nurturing, most protective, most educational parent I can possibly be. And I don’t attribute this to something only Moms do. Or Dads for that matter. It’s just parenting. Loving your kids. As such, my wife and I have shared equally in both the extreme joy, and the extreme difficulty of these first years of our kids’ lives. As I write this, in the quiet of a house with kids at daycare, finally about 75% healthy —after an episode of Strep throat, followed promptly by an extreme bout of Norovirus, in addition to a continuing sinus cold that won’t go away—I feel confident in saying I am better for it. Check back with me after pick up time. I might have a different answer.</p><p>I wrote most of the content of this blog (taken from a larger book concept) directly after brutal, terrible, nervous-breakdown-inducing kid-incidents: terrible screaming nights, terrible screaming car rides, terrible screaming afternoons for no reason (or maybe it was just hunger), terrible screaming mornings after starting out just fine, terrible screaming leaving-the-house incidents, terrible mood swings. It makes for some brutal, cynical, depressing (and hopefully funny) writing. And in spite of this, it should be said that the sweet, loving, quiet moments you see in magazines and on social media <em>do</em> happen: and they’re pure gold. They make it all worthwhile (almost). No they really do (mostly). They do.</p><p>It’s just that the mania and unrelentingness of parenting (at least in my life, with my kids) is so much, so constant, so intense, so crushing, so exhausting, so underrepresented, so glazed-over and “positivized” by parent (Mom) blogs and Instagram feeds and Christmas card photos and wannabe influencers and friends afraid that if they tell the truth about the insanity of it, everyone will think they’re bad people or shitty parents or that it’s actually hard - that the reality of it needs to be laid out in all its gory detail.</p><p>It also needs to be said that every time I dive back in here to add a section or elaborate on another nightmare scenario, or rant about another episode of sickness (like right now), there is more to add. There are updates that can be made. There are things (a lot) that can change. My youngest kid is older and doing more. My oldest kid is older and doing more. Things are better and things are worse. There are more hilarious scenes. There are more horrifying and completely dehumanizing scenes. I’ll have to at some point just accept that there is enough in here to give you a basic idea, and the rest—I’ll save for Vol. 2.</p>",
      "title": "Kids. F*#$!",
      "imageUrl": "https://source.unsplash.com/1200x600?green,landscape",
      "slug": "kids-faakkkkk",
      "tags": [
        {
          "category": "dynamic routing"
        },
        {
          "category": "vue-router"
        },
        {
          "category": "vuejs"
        }
      ],
      "published": "true",
      "date": "Tuesday May 2, 2023",
      "description": "There's a lot going on in the world. It's gruesome out there."
    }
  ],
  "name": "Return of the Living Dad"
}